{
    "language.preferred.description": "cette langue sera utilisée lorsque la sélection automatique est désactivée. tout texte qui n'est pas traduit sera affiché en anglais.\n\ncertaines langues utilisent des traductions communautaires, elles peuvent être inexactes ou incomplètes.",
    "theme": "thème",
    "theme.auto": "auto",
    "theme.description": "le thème automatique bascule entre les thèmes clair et sombre en fonction du mode d'affichage de votre appareil.",
    "video.quality.description": "si la qualité vidéo préférée n'est pas disponible, la meilleure suivante est choisie à la place.",
    "video.youtube.codec.description": "h264 : meilleure compatibilité, qualité moyenne. la qualité maximale est de 1080p. \nav1 : meilleure qualité et efficacité. prend en charge 8k & HDR. \nvp9 : même qualité qu'av1, mais le fichier est ~2x plus gros. prend en charge 4k & HDR.\n\nav1 et vp9 ne sont pas aussi largement pris en charge que h264. si av1 ou vp9 ne sont pas disponibles, h264 sera utilisé à la place.",
    "audio.bitrate.description": "le débit binaire est appliqué uniquement lors de la conversion audio vers un format avec perte. cobalt ne peut pas améliorer la qualité audio source, donc choisir un débit binaire supérieur à 128kbps peut gonfler la taille du fichier sans différence audible. la qualité perçue peut varier en fonction du format.",
    "language.auto.description": "cobalt utilisera la langue par défaut de votre navigateur si une traduction est disponible. sinon, l'anglais sera utilisé à la place.",
    "metadata.filename.description": "le style de nom de fichier ne sera utilisé que pour les fichiers tunnelisés par cobalt. certains services ne prennent pas en charge les styles de nom de fichier autres que classique.",
    "saving.description": "le moyen préféré d'enregistrer le fichier ou le lien à partir de cobalt. si la méthode préférée n'est pas disponible ou si quelque chose ne va pas, cobalt vous demandera ce qu'il faut faire ensuite.",
    "privacy.analytics.description": "l'analyse de trafic anonyme est nécessaire pour obtenir un nombre approximatif d'utilisateurs actifs de cobalt. aucune information vous concernant n'est jamais stockée. toutes les données traitées sont anonymisées et agrégées.\n\nnous utilisons une instance plausible auto-hébergée qui n'utilise pas de cookies et est entièrement conforme au RGPD, au CCPA et au PECR.",
    "processing.enable_custom.description": "cobalt utilisera un serveur de traitement personnalisé si vous le souhaitez. même si cobalt dispose de certaines mesures de sécurité, nous ne sommes pas responsables des dommages causés par une instance communautaire, car nous n'avons aucun contrôle sur celles-ci.\n\nveuillez être attentif aux instances que vous utilisez et assurez-vous qu'elles sont hébergées par des personnes en qui vous avez confiance.",
    "page.appearance": "apparence",
    "page.privacy": "confidentialité",
    "page.video": "vidéo",
    "page.audio": "audio",
    "page.download": "téléchargement",
    "page.advanced": "avancé",
    "page.debug": "informations de débogage",
    "page.instances": "instances",
    "section.general": "général",
    "section.save": "enregistrer",
    "theme.light": "clair",
    "theme.dark": "sombre",
    "video.quality": "qualité vidéo",
    "video.quality.max": "8k+",
    "video.quality.2160": "4k",
    "video.quality.1440": "1440p",
    "video.quality.1080": "1080p",
    "video.quality.720": "720p",
    "video.quality.480": "480p",
    "video.quality.360": "360p",
    "video.quality.240": "240p",
    "video.quality.144": "144p",
    "video.youtube.codec": "codec et conteneur youtube",
    "video.twitter.gif": "twitter/x",
    "video.twitter.gif.title": "convertir les vidéos en boucle en GIF",
    "video.twitter.gif.description": "la conversion en GIF est inefficace, le fichier converti peut être énorme et de basse qualité.",
    "video.tiktok.h265": "tiktok",
    "video.tiktok.h265.title": "préférer le format HEVC/H265",
    "video.tiktok.h265.description": "permet de télécharger des vidéos en 1080p au détriment de la compatibilité.",
    "audio.format": "format audio",
    "audio.format.best": "meilleur",
    "audio.format.mp3": "mp3",
    "audio.format.ogg": "ogg",
    "audio.format.wav": "wav",
    "audio.format.opus": "opus",
    "audio.format.description": "tous les formats sauf \"meilleur\" sont convertis depuis le format d'origine, il y aura une perte de qualité. lorsque le format \"meilleur\" est sélectionné, l'audio est conservé dans son format d'origine dans la mesure du possible.",
    "audio.bitrate": "débit binaire audio",
    "audio.bitrate.kbps": "kb/s",
    "audio.youtube.dub": "piste audio youtube",
    "audio.youtube.dub.title": "langue de doublage préférée",
    "audio.youtube.dub.description": "cobalt utilisera une piste audio doublée pour la langue sélectionnée si elle est disponible. sinon, l'originale sera utilisée à la place.",
    "audio.tiktok.original": "tiktok",
    "audio.tiktok.original.title": "télécharger le son original",
    "audio.tiktok.original.description": "cobalt téléchargera le son de la vidéo sans aucune modification de l'auteur du post.",
    "metadata.filename": "style de nom de fichier",
    "metadata.filename.classic": "classique",
    "metadata.filename.basic": "basique",
    "metadata.filename.pretty": "joli",
    "metadata.filename.nerdy": "intello",
    "metadata.filename.preview.video": "Titre de la vidéo",
    "metadata.filename.preview.audio": "Titre de l'audio - Auteur de l'audio",
    "metadata.file": "métadonnées de fichier",
    "metadata.disable.title": "désactiver les métadonnées de fichier",
    "metadata.disable.description": "le titre, l'artiste et d'autres informations ne seront pas ajoutés au fichier.",
    "saving.title": "méthode d'enregistrement",
    "saving.ask": "demander",
    "saving.download": "télécharger",
    "saving.share": "partager",
    "saving.copy": "copier",
    "accessibility": "accessibilité",
    "accessibility.transparency.title": "réduire la transparence visuelle",
    "accessibility.transparency.description": "réduit la transparence des surfaces et désactive les effets de flou. peut également améliorer les performances de l'interface utilisateur sur les appareils peu puissants.",
    "accessibility.motion.title": "réduire le mouvement",
    "accessibility.motion.description": "désactive les animations et les transitions chaque fois que possible.",
    "language": "langue",
    "language.auto.title": "sélection automatique",
    "language.preferred.title": "langue préférée",
    "privacy.analytics": "analyse de trafic anonyme",
    "privacy.analytics.title": "ne pas contribuer à l'analyse",
    "privacy.analytics.learnmore": "en savoir plus sur l'engagement de plausible en matière de confidentialité.",
    "privacy.tunnel": "tunnelisation",
    "privacy.tunnel.title": "toujours tunneliser les fichiers",
    "privacy.tunnel.description": "cobalt masquera votre adresse IP, les informations de votre navigateur et contournera les restrictions du réseau local. lorsqu'il est activé, les fichiers auront également des noms de fichiers lisibles qui seraient autrement du charabia.",
    "advanced.debug": "débogage",
    "advanced.debug.title": "activer les fonctionnalités de débogage",
    "advanced.debug.description": "vous donne accès à une page avec diverses informations qui peuvent être utiles pour le débogage.",
    "advanced.data": "gestion des données",
    "processing.override": "remplacement de l'instance par défaut",
    "processing.override.title": "utiliser le serveur de traitement fourni par l'instance",
    "processing.override.description": "si l'instance web fournit son propre serveur de traitement par défaut, vous pouvez choisir de l'utiliser à la place du serveur de traitement principal. assurez-vous qu'il s'agit d'un serveur de quelqu'un en qui vous avez confiance.",
    "processing.community": "instances communautaires",
    "processing.enable_custom.title": "utiliser un serveur de traitement personnalisé",
    "processing.custom.placeholder": "domaine d'instance personnalisé",
    "video.youtube.hls.description": "les fichiers se téléchargent plus rapidement et sont moins sujets aux erreurs ou aux coupures brutales. seuls les codecs h264 et vp9 sont disponibles dans ce mode. le codec audio d'origine est aac, il est réencodé pour des raisons de compatibilité, la qualité audio peut être légèrement inférieure à celle de sa version non HLS.\n\ncette option est expérimentale, elle peut disparaître ou changer à l'avenir.",
    "video.youtube.hls": "format hls youtube",
    "video.youtube.hls.title": "préférer le hls pour la vidéo et l'audio",
    "youtube.dub.original": "originale"
}
