{
    "page.appearance": "apariencia",
    "page.privacy": "privacidad",
    "page.video": "vídeo",
    "page.audio": "audio",
    "video.youtube.codec.description": "h264: mejor compatibilidad, calidad promedio. calidad máxima de 1080p. \nav1: mejor calidad y eficiencia. soporta 8k y HDR. \nvp9: misma calidad que av1, pero el archivo es ~2x más grande. soporta 4k y HDR.\n\nav1 y vp9 no son tan compatibles como h264. si av1 o vp9 no están disponibles, se usa h264 en su lugar.",
    "video.youtube.codec": "códec de vídeo y contenedor de youtube",
    "video.twitter.gif": "twitter/x",
    "video.twitter.gif.title": "convertir vídeos en bucle a GIF",
    "video.twitter.gif.description": "la conversión de GIF es ineficaz, el archivo convertido puede ser odiosamente grande y de baja calidad.",
    "page.advanced": "avanzado",
    "page.debug": "información para nerds",
    "page.instances": "instancias",
    "theme": "tema",
    "theme.auto": "auto",
    "theme.light": "claro",
    "theme.dark": "oscuro",
    "theme.description": "el tema automático cambia entre temas claros y oscuros en función del modo de visualización de tu dispositivo.",
    "video.quality": "calidad de vídeo",
    "video.quality.max": "8k+",
    "video.quality.2160": "4k",
    "video.quality.1440": "1440p",
    "video.quality.1080": "1080p",
    "video.quality.720": "720p",
    "video.quality.480": "480p",
    "video.quality.360": "360p",
    "video.quality.240": "240p",
    "video.quality.144": "144p",
    "video.quality.description": "si la calidad de vídeo preferida no está disponible, se elige la siguiente mejor.",
    "saving.description": "forma preferida de guardar el archivo o enlace de cobalt. si el método preferido no está disponible o algo va mal, cobalt te preguntará qué hacer a continuación.",
    "audio.format": "formato de audio",
    "audio.format.best": "mejor",
    "audio.format.mp3": "mp3",
    "audio.format.ogg": "ogg",
    "audio.format.wav": "wav",
    "audio.format.opus": "opus",
    "audio.format.description": "todos los formatos excepto \"mejor\" se convierten a partir del formato de origen con cierta pérdida de calidad. cuando se selecciona el formato \"mejor\", el audio se mantiene en su formato original cuando sea posible.",
    "audio.bitrate": "tasa de bits de audio",
    "audio.bitrate.kbps": "kb/s",
    "audio.bitrate.description": "la tasa de bits sólo se aplica al convertir audio a un formato con pérdidas. cobalt no puede mejorar la calidad del audio de origen, por lo que elegir una tasa de bits superior a 128 kbps puede inflar el tamaño del archivo sin que haya una diferencia audible. la calidad percibida puede variar según el formato.",
    "audio.youtube.dub": "pista de audio de youtube",
    "audio.youtube.dub.title": "idioma de doblaje preferido",
    "audio.youtube.dub.description": "cobalt usará una pista de audio doblada para el idioma seleccionado si está disponible. si no, se usará la original en su lugar.",
    "audio.tiktok.original": "tiktok",
    "audio.tiktok.original.title": "descargar sonido original",
    "audio.tiktok.original.description": "cobalt descargará el sonido del vídeo sin ningún cambio por parte del autor del post.",
    "metadata.filename": "estilo del nombre de archivo",
    "metadata.filename.classic": "clásico",
    "metadata.filename.basic": "básico",
    "metadata.filename.pretty": "bonito",
    "metadata.filename.nerdy": "para nerds",
    "metadata.filename.preview.video": "Título del vídeo",
    "metadata.filename.preview.audio": "Título del audio - Título del autor",
    "metadata.file": "metadatos del archivo",
    "metadata.disable.title": "desactivar los metadatos de archivo",
    "metadata.disable.description": "no se añadirán al archivo el título, artista y otra información.",
    "saving.title": "método de guardado",
    "saving.ask": "preguntar",
    "saving.download": "descargar",
    "saving.share": "compartir",
    "saving.copy": "copiar",
    "accessibility.transparency.title": "reducir la transparencia visual",
    "accessibility.transparency.description": "reduce la transparencia de las superficies y desactiva los efectos de desenfoque. también puede mejorar el rendimiento de la interfaz en dispositivos de bajo rendimiento.",
    "accessibility.motion.title": "movimiento reducido",
    "accessibility.motion.description": "desactiva las animaciones y transiciones siempre que sea posible.",
    "language": "idioma",
    "language.auto.title": "selección automática",
    "language.preferred.title": "idioma preferido",
    "privacy.analytics": "analíticas de tráfico anónimo",
    "privacy.analytics.title": "no contribuir a la analítica",
    "privacy.analytics.learnmore": "más información sobre el compromiso de plausible con la privacidad.",
    "privacy.tunnel.title": "siempre usar la tunelización para archivos",
    "privacy.tunnel.description": "cobalt ocultará tu dirección ip, la información del navegador y eludirá las restricciones de la red local. cuando esté activado, los archivos también tendrán nombres legibles que, de otro modo, serían ilegibles.",
    "advanced.debug": "depuración",
    "advanced.debug.title": "activar funciones para nerds",
    "metadata.filename.description": "el estilo de nombre de archivo sólo se utilizará para los archivos tunelizados por cobalt. algunos servicios no admiten estilos de nombre de archivo distintos del clásico.",
    "privacy.tunnel": "tunelización",
    "processing.community": "instancias de la comunidad",
    "processing.enable_custom.title": "utilizar un servidor de procesamiento personalizado",
    "language.auto.description": "cobalt utilizará el idioma por defecto de tu navegador si la traducción está disponible. si no, se utilizará el inglés en su lugar.",
    "language.preferred.description": "este idioma se usara cuando la selección automática esté desactivada. cualquier texto que no esté traducido se mostrará en inglés.\n\nalgunos idiomas usan traducciones de la comunidad, estas podrían ser inexactas o estar incompletas.",
    "privacy.analytics.description": "los análisis de tráfico anónimos son necesarios para obtener un número aproximado de usuarios activos de cobalt. nunca se almacena información identificable sobre ti. todos los datos procesados son anónimos y agregados.\n\nutilizamos una instancia de plausible autoalojada que no utiliza cookies y cumple plenamente con GDPR, CCPA y PECR.",
    "advanced.debug.description": "te da fácil acceso a una página con información de la aplicación que puede ser útil para depurar. habilitar esto no afecta la funcionalidad de cobalt de ninguna forma.",
    "processing.enable_custom.description": "cobalt usará una instancia de procesamiento personalizada si así lo deseas. aunque cobalt cuenta con algunas medidas de seguridad, no nos hacemos responsables de los daños que se produzcan a través de una instancia comunitaria, ya que no tenemos control sobre ellas.\n\npor favor, ten cuidado con las instancias que usas y asegúrate de que están alojadas por personas en las que confías.",
    "video.youtube.hls.title": "preferir hls para audio y vídeo",
    "youtube.dub.original": "original",
    "video.youtube.hls.description": "los archivos se descargarán más rápido y serán menos propensos a errores o cortes bruscos. sólo los códecs h264 y vp9 están disponibles en este modo. el códec original es aac, es recodificado por compatibilidad y la calidad de audio puede ser peor que su contraparte sin HLS.\n\nesta opción es experimental, y puede desaparecer o cambiar en el futuro.",
    "video.youtube.hls": "formatos hls en youtube",
    "video.h265.title": "permitir h265 para vídeos",
    "video.h265": "códec de vídeo de alta eficiencia",
    "video.h265.description": "permite descargar vídeos de plataformas como tiktok y xiaohongshu en mayor calidad al coste de compatibilidad.",
    "processing.access_key": "clave de acceso de la instancia",
    "processing.access_key.title": "usar una clave de acceso de instancia",
    "processing.access_key.description": "cobalt usará esta clave para realizar solicitudes a la instancia de procesamiento en lugar de otros métodos de autenticación. ¡asegúrate de que la instancia sea compatible con claves de api!",
    "processing.custom_instance.input.alt_text": "dominio de instancia personalizada",
    "processing.access_key.input.alt_text": "clave de acceso u-u-i-d"
}
