{
    "name": "deutsch",
    "substrings": {
        "ContactLink": "<a class=\"text-backdrop italic\" href=\"{repo}\" target=\"_blank\">erstelle ein ticket auf github</a>"
    },
    "strings": {
        "LinkInput": "link hier einfügen",
        "AboutSummary": "{appName} ist dein ort für downloads von sozialen medien und mehr. keine werbung, tracker oder anderer gruseliger bullshit. füge einfach einen link ein und es geht los!",
        "EmbedBriefDescription": "speicher, was du liebst, ohne werbung, tracker oder anderen gruseligen bullshit.",
        "MadeWithLove": "mit <3 von wukko gemacht",
        "AccessibilityInputArea": "linkeingabefeld",
        "AccessibilityOpenAbout": "Über-Popup öffnen",
        "AccessibilityDownloadButton": "Downloadbutton",
        "AccessibilityOpenSettings": "Einstellungen öffnen",
        "AccessibilityClosePopup": "Pop-up schließen",
        "AccessibilityOpenDonate": "Spenden-Popup öffnen",
        "TitlePopupAbout": "was ist {appName}?",
        "TitlePopupSettings": "einstellungen",
        "TitlePopupError": "oh-oh...",
        "TitlePopupChangelog": "was ist neu?",
        "TitlePopupDonate": "{appName} unterstützen",
        "TitlePopupDownload": "wie geht's weiter?",
        "ErrorSomethingWentWrong": "etwas ist schief gelaufen und ich konnte nichts für dich bekommen. versuche es noch einmal, aber wenn das problem weiterhin besteht, {ContactLink}.",
        "ErrorUnsupported": "es scheint, als ob dieser dienst noch nicht unterstützt wird oder dein link ungültig ist. hast du den richtigen link eingefügt?",
        "ErrorBrokenLink": "{s} wird unterstützt, aber irgendwas stimmt mit dem link nicht. hast du ihn vielleicht nicht ganz kopiert?",
        "ErrorNoLink": "ich kann nicht erraten, was du herunterladen möchtest! bitte gib mir einen link :(",
        "ErrorPageRenderFail": "wenn du dies liest, dann stimmt etwas mit dem seitenrenderer nicht. bitte {ContactLink}. gib auch die domain an, auf der dieser fehler aufgetaucht ist und den aktuellen commit-hash ({s}). vielen dank im voraus :D",
        "ErrorRateLimit": "du machst zu viele anfragen. versuch es in einer minute wieder!",
        "ErrorCouldntFetch": "ich konnte nichts über diesen link finden. überprüfe ob er funktioniert und versuche es erneut! beachte, dass manche inhalte regional eingeschränkt sein können.",
        "ErrorLengthLimit": "ich kann keine videos länger als {s} minuten verarbeiten, also wähle etwas kürzeres aus!",
        "ErrorBadFetch": "irgendetwas ist schief gelaufen als ich versucht habe informationen über deinen link zu bekommen. überprüfe, ob der link funktioniert und versuche es erneut.",
        "ErrorNoInternet": "Aktuell besteht keine Internetverbindung, oder {appName}s API ist nicht erreichbar. Überprüfe die Internetverbindung und probiere es nochmal.",
        "ErrorCantConnectToServiceAPI": "ich konnte mich nicht mit der dienst-api verbinden. vielleicht ist sie ausgefallen oder {appName} wurde blockiert. versuche es noch einmal, aber wenn der fehler weiterhin besteht, {ContactLink}.",
        "ErrorEmptyDownload": "Ich sehe nichts, was ich von deinem link runterladen könnte. Versuche einen anderen Link!",
        "ErrorLiveVideo": "das ist ein livestream, ich muss noch lernen in die zukunft zu schauen. warte bis der stream zuende ist und versuchs nochmal!",
        "SettingsAppearanceSubtitle": "Aussehen",
        "SettingsThemeSubtitle": "Thema",
        "SettingsFormatSubtitle": "format",
        "SettingsQualitySubtitle": "qualität",
        "SettingsThemeAuto": "Auto",
        "SettingsThemeLight": "hell",
        "SettingsThemeDark": "dunkel",
        "SettingsKeepDownloadButton": "&gt;&gt; sichtbar halten",
        "AccessibilityKeepDownloadButton": "den Download-Button immer sichtbar halten",
        "SettingsEnableDownloadPopup": "frage, wie gespeichert werden soll",
        "AccessibilityEnableDownloadPopup": "nach Verfahrensweise mit Downloads fragen",
        "SettingsQualityDescription": "wenn die gewählte qualität nicht verfügbar ist, wird die nächstbeste verwendet.",
        "LinkGitHubChanges": "&gt;&gt; vorherige Commits ansehen und auf GitHub beitragen",
        "NoScriptMessage": "{appName} verwendet javascript für api-anfragen und die interaktive benutzeroberfläche. du musst javascript aktivieren, um die seite zu nutzen. es gibt keine nervigen skripte, ehrenwort.",
        "DownloadPopupDescriptionIOS": "Drücke und halte den Download-Button, verstecke die Video-Vorschau, und wähle \"lade verlinkte Datei herunter\" um zu speichern.",
        "DownloadPopupDescription": "Der Download-Button öffnet einen neuen Tab mit der angeforderten Datei. Sie können dieses Pop-up in den Einstellungen deaktivieren.",
        "DownloadPopupWayToSave": "wähle einen Weg zum Speichern",
        "ClickToCopy": "Drücken zum Kopieren",
        "Download": "Herunterladen",
        "CopyURL": "Kopieren",
        "AboutTab": "Über",
        "ChangelogTab": "Änderungsverlauf",
        "DonationsTab": "Spenden",
        "SettingsVideoTab": "Video",
        "SettingsAudioTab": "Audio",
        "SettingsOtherTab": "Anderes",
        "ChangelogLastMajor": "aktuelle Version und Commit",
        "AccessibilityModeToggle": "Download-Modus umschalten",
        "DonateLinksDescription": "dies ist der beste weg zu spenden, wenn ich deine spende direkt erhalten soll.",
        "SettingsAudioFormatBest": "beste",
        "SettingsAudioFormatDescription": "wenn das \"best\" format ausgewählt ist, bekommst du audio in der bestmöglichen qualität, ohne konvertierung. alles andere wird konvertiert.",
        "Keyphrase": "speicher, was dir gefällt",
        "SettingsRemoveWatermark": "Wasserzeichen deaktivieren",
        "ErrorPopupCloseButton": "Verstanden",
        "ErrorLengthAudioConvert": "ich kann keinen audio länger als {s} minuten konvertieren. wähle das \"best\" format, wenn du einschränkungen vermeiden möchtest!",
        "SettingsAudioFullTikTok": "ganzer ton",
        "SettingsAudioFullTikTokDescription": "lädt den im video verwendeten originalton ohne zusätzliche änderungen durch den videoautor herunter.",
        "ErrorCantGetID": "es konnten keine informationen aus dem gekürzten link extrahiert werden. bitte stelle sicher, dass der link funktioniert oder versuche einen ungekürzten link. wenn das problem weiterhin besteht, {ContactLink}",
        "ErrorNoVideosInTweet": "ich konnte keine videos oder gifs in diesem tweet finden. probiere einen anderen!",
        "ImagePickerTitle": "Bilder zum Herunterladen auswählen",
        "ImagePickerDownloadAudio": "Audio herunterladen",
        "ImagePickerExplanationPC": "Rechtsklick auf ein Bild, um es zu speichern.",
        "ImagePickerExplanationPhone": "Drücken und halten Sie ein Bild, um es zu speichern.",
        "ErrorNoUrlReturned": "ich habe keinen download-link vom server erhalten. versuche es bitte noch einmal. wenn das problem weiterhin besteht, {ContactLink}",
        "ErrorUnknownStatus": "ich habe eine antwort erhalten, die ich nicht verarbeiten kann. das sollte niemals passieren. versuche es nochmal. falls es dann immer noch nicht geht, {ContactLink}",
        "PasteFromClipboard": "einfügen und herunterladen",
        "ChangelogOlder": "vorherige Version",
        "ChangelogPressToExpand": "aufklappen",
        "Miscellaneous": "Sonstiges",
        "ModeToggleAuto": "Auto Modus",
        "ModeToggleAudio": "Audio-Modus",
        "SettingsDisableNotifications": "benachrichtigungen verbergen",
        "MediaPickerTitle": "Wähle, was du speichern willst.",
        "MediaPickerExplanationPC": "Klick oder Rechtsklick um herunterzuladen was du willst.",
        "MediaPickerExplanationPhone": "Drücke oder halte gedrückt, um herunterzuladen was du willst.",
        "MediaPickerExplanationPhoneIOS": "Drücke und halte den Download-Button, verstecke die Video-Vorschau, und wähle \"lade verlinkte Datei herunter\" um zu speichern.",
        "TwitterSpaceWasntRecorded": "Dieser Twitter-Raum wurde nicht aufgezeichnet, also gibt es nichts zum herunterladen. Versuchen Sie einen anderen!",
        "ErrorCantProcess": "Ich konnte deine Anfrage nicht bearbeiten :(\nDu kannst es erneut versuchen, aber wenn das Problem weiterhin besteht, bitte {ContactLink}.",
        "ChangelogPressToHide": "einklappen",
        "Donate": "Spende",
        "DonateSub": "Hilf mir, es am laufen zu halten.",
        "DonateExplanation": "{appName} schaltet keine Werbung und verkauft Ihre Daten nicht (und wird es auch nie tun), daher ist es <span class=\"text-backdrop\">völlig kostenlos zu nutzen</span>. Jedoch stellt es sich heraus, dass die Entwicklung und Aufrechterhaltung eines Webdienstes, welcher von über 80 Tausend Menschen genutzt wird, nicht so einfach ist.\n\nWenn Sie jemals {appName} nützlich fanden und es online halten möchten oder einfach dem Entwickler danken möchten, können Sie gerne einen Beitrag leisten! Jeder Cent hilft und wird SEHR geschätzt :D",
        "DonateVia": "Spenden via",
        "DonateHireMe": "...alternativ kannst du mich auch <a class=\"text-backdrop italic\" href=\"{s}\" target=\"_blank\">beauftragen</a> :)",
        "SettingsVideoMute": "Ton stummschalten",
        "SettingsVideoMuteExplanation": "entfernt audio von video-downloads wenn möglich.",
        "ErrorSoundCloudNoClientId": "ich konnte den temporären token nicht erhalten, der benötigt wird, um songs aus soundcloud herunterzuladen. versuche es noch einmal. falls das Problem weiterhin besteht, {ContactLink}.",
        "CollapseServices": "unterstützte Dienste",
        "CollapseSupport": "support & quellcode",
        "CollapsePrivacy": "datenschutzrichtlinie",
        "ServicesNote": "diese liste ist nicht vollständig und erweitert sich im laufe der zeit, denke daran nochmal nachzuschauen!",
        "FollowSupport": "folge {appName} auf mastodon oder twitter für support, umfragen, neuigkeiten, und mehr:",
        "SupportNote": "bitte beachte, dass das beantworten von fragen und fehlermeldungen eine weile dauert, es gibt nur eine Person die alles managed.",
        "SourceCode": "melde Probleme, erkundige den Quellcode, sterne oder forke das Repo:",
        "PrivacyPolicy": "{appName}s datenschutzrichtlinie ist einfach: keine deiner daten werden gesammelt oder gespeichert. null, nada, niente, nichts.\nwas du herunterlädst ist dein ding, nicht meins.\n\neinige nicht zurückverfolgbare daten werden vorübergehend gespeichert, wenn ein angeforderter download live rendering erfordert. das ist notwendig, damit diese funktion funktioniert.\n\nin diesem fall werden, <span class=\"text-backdrop\">der salted sha256 hash deiner ip-adresse</span> und informationen über den angeforderten stream temporär im RAM des servers für <span class=\"text-backdrop\">2 minuten</span> gespeichert. nach 2 minuten werden alle zuvor gespeicherten informationen dauerhaft gelöscht. der hash deiner ip-adresse wird verwendet, <span class=\"text-backdrop\">um den zugang zum stream auf dich zu beschränken</span>.\nniemand (nichtmal ich) hat zugriff auf diese daten, da die offizielle {appName}-codebasis keine möglichkeit bietet, sie außerhalb der verarbeitungsfunktionen zu lesen.\n\ndu kannst {appName}s <a class=\"text-backdrop italic\" href=\"{repo}\" target=\"_blank\">github repo</a> selbst überprüfen und sehen, dass tatsächlich nichts dauerhaft gespeichert wird.",
        "ErrorYTUnavailable": "Dieses YouTube-Video ist nicht verfügbar oder Altersbeschränkt. Ich kann derzeit keine Videos mit sensiblen Inhalten herunterladen. Versuche ein anderes...",
        "ErrorYTTryOtherCodec": "Ich konnte nichts mit deinen Einstellungen zum Download finden. Versuche einen anderen Codec oder andere Qualitätseinstellungen!\n\nBitte beachte: Die YouTube API agiert manchmal unerwartet. Dafür kann ich nichts - das ist Googles schuld.",
        "SettingsCodecSubtitle": "YouTube-Codec",
        "SettingsCodecDescription": "h264: Im Allgemeinen bessere Unterstützung, aber die Qualität ist auf 1080p begrenzt.\nav1: geringe Unterstützung, unterstützt aber 8k & HDR.\nvp9: Normalerweise höchste Bitrate, bewahrt die meisten Details. Unterstützt 4k & HDR.\n\nFür die beste Kompatibilität wähle H264 aus.",
        "SettingsAudioDub": "YouTube-Audiospur",
        "SettingsAudioDubDescription": "Legt fest, welche Audiospur verwendet werden soll. Wenn die synchronisierte Spur nicht verfügbar ist, wird stattdessen die ursprüngliche Videosprache verwendet.\n\nOriginal: Originalsprache wird verwendet.\nAuto: Sprache wird aus Browser übernommen.",
        "SettingsDubDefault": "German (de-de)",
        "SettingsDubAuto": "Auto",
        "SettingsVimeoPrefer": "Vimeo Download-Typ",
        "SettingsVimeoPreferDescription": "progressive: direkter link zu vimeo's cdn. maximal 1080p.\ndash: video und audio werden durch {appName} zu einer datei kombiniert. maximal 4k.\n\nwähle \"progressive\" für bessere kompabilität mit editoren/wiedergabe/sozialen medien. falls progressive nicht funktioniert, wird automatisch dash genutzt. ",
        "ShareURL": "Teilen"
    }
}
