{
    "name": "deutsch",
    "substrings": {
        "ContactLink": "<a class=\"text-backdrop link\" href=\"{repo}\" target=\"_blank\">Erstelle ein Problem auf GitHub</a>."
    },
    "strings": {
        "AppTitleCobalt": "Cobalt",
        "LinkInput": "link hier einfügen",
        "AboutSummary": "Cobalt ist dein Anlaufpunkt für Downloads von Sozialen- und Medienplattformen. Keine Werbung, Tracker oder sonstigen unangenehmen Kram. Einfach einen Freigabelink einfügen und du kannst loslegen!",
        "EmbedBriefDescription": "Speichere, was du liebst. Keine Werbung, Tracker oder sonstiger unangenehmer Kram.",
        "MadeWithLove": "mit <3 von wukko gemacht",
        "AccessibilityInputArea": "linkeingabefeld",
        "AccessibilityOpenAbout": "Über-Popup öffnen",
        "AccessibilityDownloadButton": "Downloadbutton",
        "AccessibilityOpenSettings": "Einstellungen öffnen",
        "AccessibilityOpenDonate": "Spenden-Popup öffnen",
        "TitlePopupAbout": "Was ist Cobalt?",
        "TitlePopupSettings": "einstellungen",
        "TitlePopupError": "oh-oh...",
        "TitlePopupChangelog": "was ist neu?",
        "TitlePopupDonate": "Unterstütze Cobalt",
        "TitlePopupDownload": "Wie speichern?",
        "ErrorSomethingWentWrong": "etwas ist schief gelaufen und ich konnte nichts für dich bekommen. versuche es noch einmal, aber wenn das problem weiterhin besteht, {ContactLink}.",
        "ErrorUnsupported": "es scheint, als ob dieser dienst noch nicht unterstützt wird oder dein link ungültig ist. hast du den richtigen link eingefügt?",
        "ErrorBrokenLink": "{s} wird unterstützt, aber irgendwas stimmt mit dem link nicht. hast du ihn vielleicht nicht ganz kopiert?",
        "ErrorNoLink": "ich kann nicht erraten, was du herunterladen möchtest! bitte gib mir einen link :(",
        "ErrorPageRenderFail": "wenn du dies liest, dann stimmt etwas mit dem seitenrenderer nicht. bitte {ContactLink}. gib auch die domain an, auf der dieser fehler aufgetaucht ist und den aktuellen commit-hash ({s}). vielen dank im voraus :D",
        "ErrorRateLimit": "du machst zu viele anfragen. versuch es in einer minute wieder!",
        "ErrorCouldntFetch": "ich konnte nichts über diesen link finden. überprüfe ob er funktioniert und versuche es erneut! beachte, dass manche inhalte regional eingeschränkt sein können.",
        "ErrorLengthLimit": "ich kann keine videos länger als {s} minuten verarbeiten, also wähle etwas kürzeres aus!",
        "ErrorBadFetch": "irgendetwas ist schief gelaufen als ich versucht habe informationen über deinen link zu bekommen. überprüfe, ob der link funktioniert und versuche es erneut.",
        "ErrorNoInternet": "Es besteht keine Internetverbindung oder die Cobalt API ist vorübergehend nicht verfügbar. Überprüfe deine Verbindung und versuche es erneut.",
        "ErrorCantConnectToServiceAPI": "Ich konnte keine Verbindung zur Service-API herstellen. Möglicherweise ist sie nicht erreichbar oder Cobalt wurde blockiert. Versuche es erneut, aber wenn der Fehler weiterhin auftritt, {ContactLink}.",
        "ErrorEmptyDownload": "Ich sehe nichts, was ich von deinem link runterladen könnte. Versuche einen anderen Link!",
        "ErrorLiveVideo": "das ist ein livestream, ich muss noch lernen in die zukunft zu schauen. warte bis der stream zuende ist und versuchs nochmal!",
        "SettingsAppearanceSubtitle": "Aussehen",
        "SettingsThemeSubtitle": "Thema",
        "SettingsFormatSubtitle": "format",
        "SettingsQualitySubtitle": "qualität",
        "SettingsThemeAuto": "Auto",
        "SettingsThemeLight": "hell",
        "SettingsThemeDark": "dunkel",
        "SettingsKeepDownloadButton": "&gt;&gt; sichtbar halten",
        "AccessibilityKeepDownloadButton": "den Download-Button immer sichtbar halten",
        "SettingsEnableDownloadPopup": "frage, wie gespeichert werden soll",
        "AccessibilityEnableDownloadPopup": "nach Verfahrensweise mit Downloads fragen",
        "SettingsQualityDescription": "wenn die gewählte qualität nicht verfügbar ist, wird die nächstbeste verwendet.",
        "LinkGitHubChanges": "&gt;&gt; vorherige Commits ansehen und auf GitHub beitragen",
        "NoScriptMessage": "Cobalt verwendet JavaScript für API-Anfragen und die interaktive Benutzeroberfläche. Du musst JavaScript erlauben, um diese Seite zu verwenden. Es gibt keine lästigen Skripte, versprochen.",
        "DownloadPopupDescriptionIOS": "Einfachste Methode, um Videos auf iOS zu speichern:\n1. Füge <a class=\"text-backdrop link\" href=\"{saveToGalleryShortcut}\" target=\"_blank\">diesen Siri-Shortcut</a> hinzu.\n2. Drücke oben auf \"Teilen\" und wähle in der angezeigten Freigabeleiste \"In Fotos speichern\".\nWenn du dazu aufgefordert wirst, überprüfe die Berechtigungsanfrage und drücke \"Immer erlauben\".\n\nAlternative Methode:\nHalte die Download-Schaltfläche gedrückt, verberge die Video-Vorschau und wähle \"Verknüpfte Datei herunterladen\", um herunterzuladen.\nÖffne dann Safari Downloads, wähle die heruntergeladene Datei aus, öffne das Freigabemenü und drücke schließlich \"Video speichern\".",
        "DownloadPopupDescription": "Der Download-Button öffnet einen neuen Tab mit der angeforderten Datei. Sie können dieses Pop-up in den Einstellungen deaktivieren.",
        "ClickToCopy": "Drücken zum Kopieren",
        "Download": "Herunterladen",
        "CopyURL": "Kopieren",
        "AboutTab": "Über",
        "ChangelogTab": "Änderungsverlauf",
        "DonationsTab": "Spenden",
        "SettingsVideoTab": "Video",
        "SettingsAudioTab": "Audio",
        "SettingsOtherTab": "Anderes",
        "ChangelogLastMajor": "aktuelle Version und Commit",
        "AccessibilityModeToggle": "Download-Modus umschalten",
        "DonateLinksDescription": "dies ist der beste weg zu spenden, wenn ich deine spende direkt erhalten soll.",
        "SettingsAudioFormatBest": "beste",
        "SettingsAudioFormatDescription": "wenn das \"best\" format ausgewählt ist, bekommst du audio in der bestmöglichen qualität, ohne konvertierung. alles andere wird konvertiert.",
        "Keyphrase": "speicher, was dir gefällt",
        "SettingsRemoveWatermark": "Wasserzeichen deaktivieren",
        "ErrorPopupCloseButton": "Verstanden",
        "ErrorLengthAudioConvert": "ich kann keinen audio länger als {s} minuten konvertieren. wähle das \"best\" format, wenn du einschränkungen vermeiden möchtest!",
        "SettingsAudioFullTikTok": "ganzer ton",
        "SettingsAudioFullTikTokDescription": "lädt den im video verwendeten originalton ohne zusätzliche änderungen durch den videoautor herunter.",
        "ErrorCantGetID": "es konnten keine informationen aus dem gekürzten link extrahiert werden. bitte stelle sicher, dass der link funktioniert oder versuche einen ungekürzten link. wenn das problem weiterhin besteht, {ContactLink}",
        "ErrorNoVideosInTweet": "ich konnte keine medien in diesem tweet finden. probiere einen anderen!",
        "ImagePickerTitle": "Bilder zum Herunterladen auswählen",
        "ImagePickerDownloadAudio": "Audio herunterladen",
        "ImagePickerExplanationPC": "Rechtsklick auf ein Bild, um es zu speichern.",
        "ImagePickerExplanationPhone": "Drücken und halten Sie ein Bild, um es zu speichern.",
        "ErrorNoUrlReturned": "ich habe keinen download-link vom server erhalten. versuche es bitte noch einmal. wenn das problem weiterhin besteht, {ContactLink}",
        "ErrorUnknownStatus": "ich habe eine antwort erhalten, die ich nicht verarbeiten kann. das sollte niemals passieren. versuche es nochmal. falls es dann immer noch nicht geht, {ContactLink}",
        "PasteFromClipboard": "einfügen und herunterladen",
        "ChangelogOlder": "vorherige Version",
        "ChangelogPressToExpand": "aufklappen",
        "Miscellaneous": "Sonstiges",
        "ModeToggleAuto": "Auto Modus",
        "ModeToggleAudio": "Audio-Modus",
        "SettingsDisableNotifications": "benachrichtigungen verbergen",
        "MediaPickerTitle": "Wähle, was du speichern willst.",
        "MediaPickerExplanationPC": "Klick oder Rechtsklick um herunterzuladen was du willst.",
        "MediaPickerExplanationPhone": "Drücke oder halte gedrückt, um herunterzuladen was du willst.",
        "TwitterSpaceWasntRecorded": "Dieser Twitter-Raum wurde nicht aufgezeichnet, also gibt es nichts zum herunterladen. Versuchen Sie einen anderen!",
        "ErrorCantProcess": "Ich konnte deine Anfrage nicht bearbeiten :(\nDu kannst es erneut versuchen, aber wenn das Problem weiterhin besteht, bitte {ContactLink}.",
        "ChangelogPressToHide": "einklappen",
        "Donate": "Spende",
        "DonateSub": "Hilf dabei, die Online-Verfügbarkeit aufrechtzuerhalten",
        "DonateExplanation": "\nCobalt belästigt dich nicht mit Werbung und verkauft keine persönlichen Daten. Daher ist es <span class=\"text-backdrop\">für alle komplett kostenlos</span>. Die Entwicklung und Wartung eines medienintensiven Dienstes, der von über 350.000 Menschen genutzt wird, ist jedoch ziemlich kostspielig. Sowohl in Bezug auf Zeit als auch Geld. Als Student ist es für mich recht schwierig, solche Ausgaben alleine zu bewältigen.\n\nWenn Cobalt dir in der Vergangenheit geholfen hat und du dazu beitragen möchtest, dass es wächst und sich weiterentwickelt, kannst du das durch eine Spende tun!\n\nDurch deine Spende hilfst du allen, die Cobalt nutzen: Lehrer, Schüler, Musiker, Content-Ersteller, Künstler, Dozenten und viele andere!\n\nIn den letzten Monaten haben Spenden es mir ermöglicht:\n*; Die Stabilität und Verfügbarkeit auf nahezu 100 % zu erhöhen.\n*; ALLE Downloads zu beschleunigen, insbesondere bei größeren Dateien.\n*; Die Cobalt-API für die kostenlose öffentliche Nutzung zu veröffentlichen.\n*; Mehrere massive Nutzeranstürme ohne Ausfallzeit zu bewältigen.\n*; Zu einem zuverlässigen und vertrauenswürdigen Cloud-Infrastrukturanbieter zu wechseln.\n*; Die Front-End- und API-Komponenten für Widerstandsfähigkeit und zukünftige Dezentralisierung zu trennen.\n\n<span class=\"text-backdrop\">Jeder Cent zählt und wird sehr geschätzt</span>, du kannst wirklich einen Unterschied machen!",
        "DonateVia": "Spenden via",
        "DonateHireMe": "... oder du kannst mich sogar <a class=\"text-backdrop link\" href=\"{s}\" target=\"_blank\">einstellen</a> :)",
        "SettingsVideoMute": "Ton stummschalten",
        "SettingsVideoMuteExplanation": "entfernt audio von video-downloads wenn möglich.",
        "ErrorSoundCloudNoClientId": "ich konnte den temporären token nicht erhalten, der benötigt wird, um songs aus soundcloud herunterzuladen. versuche es noch einmal. falls das Problem weiterhin besteht, {ContactLink}.",
        "CollapseServices": "unterstützte dienste",
        "CollapseSupport": "support & quellcode",
        "CollapsePrivacy": "datenschutzrichtlinie",
        "ServicesNote": "diese liste ist nicht vollständig und erweitert sich im laufe der zeit, denke daran nochmal nachzuschauen!",
        "FollowSupport": "Bleibe mit Cobalt in Kontakt für Unterstützung, Umfragen, Neuigkeiten und vieles mehr:",
        "SupportNote": "Bitte beachte, dass eine Antwort eine Weile dauern kann, da alles von einer einzigen Person verwaltet wird.",
        "SourceCode": "melde Probleme, erkundige den Quellcode, sterne oder forke das Repo:",
        "PrivacyPolicy": "Cobalts Datenschutzrichtlinie ist einfach: Es werden keinerlei Daten über dich erfasst oder gespeichert. Null, nichts, nada.\nWas du herunterlädst, betrifft ausschließlich dich und niemand sonst.\n\nWenn dein Download eine Live-Darstellung erfordert, werden einige nicht nachverfolgbare Daten vorübergehend im RAM des Servers gespeichert. Das ist für diese Funktion notwendig.\n\nIn diesem Fall werden Informationen über den angeforderten Inhalt für <span class=\"text-backdrop\">20 Sekunden</span> gespeichert und dann dauerhaft entfernt.\nNiemand (auch ich nicht) hat Zugriff auf diese Daten. Der offizielle Cobalt-Code bietet keine Möglichkeit, sie außerhalb von Verarbeitungsfunktionen zu lesen.\n\nDu kannst den <a class=\"text-backdrop link\" href=\"{repo}\" target=\"_blank\">Quellcode von Cobalt</a> selbst überprüfen und sehen, dass alles wie angegeben ist.",
        "ErrorYTUnavailable": "Dieses YouTube-Video ist nicht verfügbar. Es könnte aufgrund regionaler Beschränkungen oder Altersbeschränkungen nicht zugänglich sein. Versuche es mit einem anderen Video!",
        "ErrorYTTryOtherCodec": "Ich konnte nichts mit deinen Einstellungen zum Download finden. Versuche einen anderen Codec oder andere Qualitätseinstellungen!\n\nBitte beachte: Die YouTube API agiert manchmal unerwartet. Dafür kann ich nichts - das ist Googles schuld.",
        "SettingsCodecSubtitle": "YouTube-Codec",
        "SettingsCodecDescription": "h264: Im Allgemeinen bessere Unterstützung, aber die Qualität ist auf 1080p begrenzt.\nav1: geringe Unterstützung, unterstützt aber 8k & HDR.\nvp9: Normalerweise höchste Bitrate, bewahrt die meisten Details. Unterstützt 4k & HDR.\n\nFür die beste Kompatibilität wähle H264 aus.",
        "SettingsAudioDub": "YouTube-Audiospur",
        "SettingsAudioDubDescription": "Definiert, welche Audiospur verwendet wird. Wenn die synchronisierte Spur nicht verfügbar ist, wird stattdessen die Originalvideosprache verwendet.\n\nOriginal: Die Originalvideosprache wird verwendet.\nAuto: Die Standardsprache des Browsers (und von Cobalt) wird verwendet.",
        "SettingsDubDefault": "German (de-de)",
        "SettingsDubAuto": "Auto",
        "SettingsVimeoPrefer": "Vimeo Download-Typ",
        "SettingsVimeoPreferDescription": "progressive: Direkter Dateilink zum Vimeo-CDN. Maximale Qualität ist 1080p.\ndash: Video und Audio werden von Cobalt zu einer Datei zusammengeführt. Maximale Qualität ist 4k.\n\nWähle \"progressive\", wenn du die beste Kompatibilität für Editor, Player und soziale Medien wünschst. Wenn der progressive Download nicht verfügbar ist, wird stattdessen dash verwendet.",
        "ShareURL": "Teilen",
        "ErrorTweetUnavailable": "ich konnte gar nichts über diesen tweet finden. vielleicht ist seine sichtbarkeit eingeschränkt. versuche einen anderen!",
        "ErrorTwitterRIP": "Twitter hat den Zugriff auf Inhalte für nicht authentifizierte Benutzer eingeschränkt. Während es möglich ist, reguläre Tweets abzurufen, sind Spaces leider derzeit nicht verfügbar Ich suche nach möglichen Lösungen.",
        "UrgentDonate": "Cobalt braucht deine Hilfe!",
        "PopupCloseDone": "fertig",
        "Accessibility": "Barrierefreiheit",
        "SettingsReduceTransparency": "Transparenz reduzieren",
        "SettingsDisableAnimations": "Animationen deaktivieren",
        "FeatureErrorGeneric": "Dein Browser erlaubt oder unterstützt diese Funktion nicht. Überprüfe, ob Updates verfügbar sind, und versuche es erneut!",
        "ClipboardErrorFirefox": "Du verwendest Firefox, bei dem die Funktion zum Lesen der Zwischenablage deaktiviert ist.\n\nDu kannst das Problem beheben, indem du den Schritten folgst, die <a class=\"text-backdrop link\" href=\"{repo}/wiki/Troubleshooting#how-to-fix-clipboard-pasting-in-firefox\" target=\"_blank\">hier</a> aufgelistet sind!\n\n...oder du kannst den Link manuell einfügen.",
        "ClipboardErrorNoPermission": "Cobalt kann nicht auf den neuesten Eintrag in deiner Zwischenablage zugreifen, ohne deine Erlaubnis.\n\nWenn du keinen Zugriff geben möchtest, füge den Link einfach manuell ein.\n\nWenn du dies möchtest, gehe zu den Seiteneinstellungen und aktiviere die Zwischenablage-Berechtigung.",
        "SupportSelfTroubleshooting": "Treten Probleme auf? Versuche zuerst den <a class=\"text-backdrop link\" href=\"{repo}/wiki/Troubleshooting\" target=\"_blank\">Problembehandlung-Leitfaden</a>!",
        "AccessibilityGoBack": "Gehe zurück und schließe das Pop-up.",
        "CollapseKeyboard": "Tastenkombinationen",
        "KeyboardShortcutsIntro": "Nutze Cobalt noch schneller mit Tastenkombinationen:",
        "KeyboardShortcutQuickPaste": "Füge den Link ein",
        "KeyboardShortcutClear": "Leere das Eingabefeld für den Link",
        "KeyboardShortcutClosePopup": "Schließe alle Pop-ups",
        "CollapseLegal": "Rechtliche Informationen",
        "FairUse": "Cobalt ist ein Werkzeug zur Vereinfachung von Internet-Downloads und übernimmt <span class=\"text-backdrop\">keine Haftung</span>. Du bist für das, was du herunterlädst, wie du den Inhalt verwendest und verteilst, verantwortlich.\n\nCobalt erfasst keinerlei Informationen über dich. Es ist für mich unmöglich, dich zu verraten. Bitte sei jedoch achtsam, wenn du Inhalte von anderen nutzt, und gib immer die ursprünglichen Schöpfer an!\n\nBei Verwendung zu Bildungszwecken (Vorlesungen, Hausaufgaben usw.) füge bitte den Quelllink hinzu.\n\nFair Use und angemessene Anerkennung kommen allen zugute.",
        "UrgentFeatureUpdate71": "Mehr unterstützte Dienste!",
        "UrgentThanks": "Danke für die Unterstützung!",
        "SettingsDisableMetadata": "Füge keine Metadaten hinzu",
        "UrgentNewDomain": "Neue Domain, dasselbe Cobalt",
        "NewDomainWelcomeTitle": "Hallo!",
        "NewDomainWelcome": "Cobalt zieht um! Gleiche Funktionen, gleicher Besitzer, einfach eine leichter zu merkende Domain. Und immer noch keine Werbung.\n\n<span class=\"text-backdrop\">cobalt.tools</span> ist die neue Hauptdomain, das heißt, wo du dich gerade befindest. Stelle sicher, deine Lesezeichen zu aktualisieren und die Web-App erneut zu installieren!",
        "DataTransferSuccess": "Übrigens, deine Einstellungen wurden automatisch übertragen :)",
        "DataTransferError": "Etwas ist schiefgelaufen bei der Übertragung deiner Einstellungen. Du musst die Einstellungen öffnen und Cobalt manuell konfigurieren.",
        "SupportNotAffiliated": "Cobalt hat <span class=\"text-backdrop\">keine Verbindung</span> zu den oben aufgeführten Diensten."
    }
}
