{
    "name": "deutsch",
    "substrings": {
        "ContactLink": "<a class=\"text-backdrop italic\" href=\"{repo}\" target=\"_blank\">melde ein Problem auf GitHub</a>"
    },
    "strings": {
        "LinkInput": "Link hier einfügen",
        "AboutSummary": "{appName} ist der richtige Ort für Social Media-Downloads. Keine Werbung, Tracker oder anderer gruseliger Bullshit. Füge einfach einen Teilen-Link ein und du bist bereit zu rocken!",
        "EmbedBriefDescription": "speichern Sie Inhalte aus sozialen Medien ohne Ärgernisse",
        "MadeWithLove": "made with <3 by wukko",
        "AccessibilityInputArea": "linkeingabefeld",
        "AccessibilityOpenAbout": "Über-Popup öffnen",
        "AccessibilityDownloadButton": "Downloadbutton",
        "AccessibilityOpenSettings": "Einstellungen öffnen",
        "AccessibilityClosePopup": "Pop-up schließen",
        "AccessibilityOpenDonate": "Spenden-Popup öffnen",
        "TitlePopupAbout": "Was ist {appName}?",
        "TitlePopupSettings": "Einstellungen",
        "TitlePopupError": "Oh-oh...",
        "TitlePopupChangelog": "Was gibt es Neues?",
        "TitlePopupDonate": "{appName} unterstützen",
        "TitlePopupDownload": "herunterladen",
        "ErrorSomethingWentWrong": "Irgendetwas ist schiefgelaufen und es konnte nichts gefunden werden. Du kannst es nochmal probieren, aber sollte das Problem weiterhin bestehen, kontaktiere bitte {ContactLink}.",
        "ErrorUnsupported": "Es scheint, als ob dieser Dienst noch nicht unterstützt wird oder der Link ungültig ist.",
        "ErrorBrokenLink": "{s} ist unterstützt, aber irgendwas stimmt mit dem Link nicht. Ist der Link vollständig?",
        "ErrorNoLink": "Ich kann nicht erraten, was du herunterladen möchtest! Bitte gib mir einen Link.",
        "ErrorPageRenderFail": "Etwas ist schiefgelaufen und die Seite konnte nicht gerendert werden. Wenn es sich hierbei um ein wiederkehrendes oder kritisches Problem handelt, bitte {ContactLink}. Es wäre nützlich, wenn du den aktuellen Commit-Hash ({s}) und die Fehlererstellung angegeben hast. Vielen Dank im Voraus! :D",
        "ErrorRateLimit": "Du stellst zu viele anfragen. Versuch es in einer Minute wieder!",
        "ErrorCouldntFetch": "Ich konnte keine Informationen über diesen Link finden. Bitte überprüfe, ob der Link korrekt ist und versuche es noch einmal. ",
        "ErrorLengthLimit": "Die aktuelle Längenbegrenzung ist {s} Minuten. Das Video, das du herunterladen wolltest, ist länger als {s} Minuten. Wähle bitte etwas anderes.",
        "ErrorBadFetch": "Ein Fehler ist aufgetreten, als ich versucht habe, Informationen über den Link zu erhalten. Sind Sie sicher, dass er funktioniert? Überprüfen Sie, ob er funktioniert, und versuchen Sie es erneut.",
        "ErrorCorruptedStream": "Dieser Download ist leider beschädigt. Versuche es nochmal oder probiere ein anderes Format/eine andere Auflösung.",
        "ErrorNoInternet": "Aktuell besteht keine Internetverbindung, oder {appName}s API ist nicht erreichbar. Überprüfe die Internetverbindung und probiere es nochmal.",
        "ErrorCantConnectToServiceAPI": "Es konnte keine Verbindung zu {s}s API hergestellt werden. Anscheinend ist {s} nicht erreichbar oder {appName}s Server IP wurde gesperrt. Versuchen Sie es später erneut.",
        "ErrorEmptyDownload": "Hier ist nichts zum Runterladen. Versuche einen anderen Link.",
        "ErrorLiveVideo": "Ich kann nicht in die Zukunft schauen und ein Live-Video herunterladen, währen es gerade läuft. Warte auf das Ende des Streams und versuche es erneut!",
        "SettingsAppearanceSubtitle": "Aussehen",
        "SettingsThemeSubtitle": "Thema",
        "SettingsFormatSubtitle": "Downloadformat",
        "SettingsQualitySubtitle": "qualität",
        "SettingsThemeAuto": "Auto",
        "SettingsThemeLight": "hell",
        "SettingsThemeDark": "dunkel",
        "SettingsQualitySwitchMax": "max",
        "SettingsQualitySwitchHigh": "hoch",
        "SettingsQualitySwitchMedium": "mittel",
        "SettingsQualitySwitchLow": "niedrig",
        "SettingsQualitySwitchLowest": "niedrigste",
        "SettingsKeepDownloadButton": "&gt;&gt; sichtbar halten",
        "AccessibilityKeepDownloadButton": "den Download-Button immer sichtbar halten",
        "SettingsEnableDownloadPopup": "nach einer Möglichkeit zum Speichern fragen",
        "AccessibilityEnableDownloadPopup": "nach Verfahrensweise mit Downloads fragen",
        "SettingsFormatDescription": "Wähle webm für maximale Qualität. Webm-Videos haben i.d.R. eine höhere Bitrate, aber iOS-Geräte können sie nicht nativ abspielen.",
        "SettingsQualityDescription": "Wenn die gewählte Qualitätsstufe nicht verfügbar ist, wird eine möglichst ähnliche gewählt.\nUm ein YouTube Video auf sozialen Medien zu posten, wähle mp4 und 720p.",
        "LinkGitHubChanges": "&gt;&gt; vorherige Commits ansehen und auf GitHub beitragen",
        "NoScriptMessage": "{appName} verwendet Javascript für API-Anfragen und die interaktive Schnittstelle. Ich nutze keine Werbung oder Tracker, Ehrenwort.",
        "DownloadPopupDescriptionIOS": "Drücke und halte den Download-Button, verstecke die Video-Vorschau, und wähle \"lade verlinkte Datei herunter\" um zu speichern.",
        "DownloadPopupDescription": "Der Download-Button öffnet einen neuen Tab mit der angeforderten Datei. Sie können dieses Pop-up in den Einstellungen deaktivieren.",
        "DownloadPopupWayToSave": "wähle einen Weg zum Speichern",
        "ClickToCopy": "Drücken zum Kopieren",
        "Download": "herunterladen",
        "CopyURL": "URL kopieren",
        "AboutTab": "Über",
        "ChangelogTab": "Änderungsverlauf",
        "DonationsTab": "Spenden",
        "SettingsVideoTab": "Video",
        "SettingsAudioTab": "Audio",
        "SettingsOtherTab": "Anderes",
        "ChangelogLastMajor": "aktuelle Version und Commit",
        "AccessibilityModeToggle": "Download-Modus umschalten",
        "DonateLinksDescription": "Spende-Links öffnen einem neuen Tab. Das ist der beste Weg zu spenden, wenn das Geld direkt bei mir ankommen soll.",
        "SettingsAudioFormatBest": "beste",
        "SettingsAudioFormatDescription": "Wenn bestes Format ausgewählt ist, bekommst du die beste verfügbare Audioqualität, da es nicht neu kodiert wird. Alles andere wird neu kodiert.",
        "Keyphrase": "speicher, was dir gefällt",
        "SettingsRemoveWatermark": "Wasserzeichen deaktivieren",
        "ErrorPopupCloseButton": "Verstanden",
        "ErrorLengthAudioConvert": "Das aktuelle Längenlimit für die Audio-Konvertierung beträgt {s} Minuten. Wählen Sie \"bestes Format\" aus, wenn Sie diese Einschränkung vermeiden möchten.",
        "SettingsAudioFullTikTok": "komplette Audiodatei herunterladen",
        "SettingsAudioFullTikTokDescription": "Lädt den im Video verwendeten Originalton ohne zusätzliche Änderungen durch den Videoautor herunter.",
        "ErrorCantGetID": "Es konnten keine Informationen aus dem gekürzten Link extrahiert werden. Bitte stelle sicher, dass der Link funktioniert oder versuche einen ungekürzten Link.",
        "ErrorNoVideosInTweet": "Ich konnte keine Videos oder GIFs in diesem Tweet finden. Probiere einen anderen!",
        "ImagePickerTitle": "Bilder zum Herunterladen auswählen",
        "ImagePickerDownloadAudio": "Audio herunterladen",
        "ImagePickerExplanationPC": "Rechtsklick auf ein Bild, um es zu speichern.",
        "ImagePickerExplanationPhone": "Drücken und halten Sie ein Bild, um es zu speichern.",
        "ErrorNoUrlReturned": "Der Server hat keinen Download-Link zurückgegeben. Das sollte nie passieren. Laden Sie die Seite neu und versuchen Sie es erneut, aber wenn es nicht hilft, {ContactLink}.",
        "ErrorUnknownStatus": "Ich habe eine Antwort erhalten, die ich nicht verarbeiten kann. Wahrscheinlich ist etwas mit dem Status falsch. Dies sollte nie passieren. Laden Sie die Seite neu und versuchen Sie es erneut. Wenn das aber nicht hilft, {ContactLink}.",
        "PasteFromClipboard": "aus Zwischenablage einfügen",
        "ChangelogOlder": "vorherige Version",
        "ChangelogPressToExpand": "drücke zum ausklappen",
        "Miscellaneous": "Sonstiges",
        "ModeToggleAuto": "Auto Modus",
        "ModeToggleAudio": "Audio-Modus",
        "SettingsDisableNotifications": "Benachrichtigungspunkte ausblenden",
        "MediaPickerTitle": "Wähle, was du speichern willst.",
        "MediaPickerExplanationPC": "Klick oder Rechtsklick um herunterzuladen was du willst.",
        "MediaPickerExplanationPhone": "Drücke oder halte gedrückt, um herunterzuladen was du willst.",
        "MediaPickerExplanationPhoneIOS": "Drücke und halte den Download-Button, verstecke die Video-Vorschau, und wähle \"lade verlinkte Datei herunter\" um zu speichern.",
        "TwitterSpaceWasntRecorded": "Dieser Twitter-Raum wurde nicht aufgezeichnet, also gibt es nichts zum herunterladen. Versuchen Sie einen anderen!",
        "ErrorCantProcess": "Ich konnte deine Anfrage nicht bearbeiten :(\nDu kannst es erneut versuchen, aber wenn das Problem weiterhin besteht, bitte {ContactLink}.",
        "ChangelogPressToHide": "drücke zum einklappen",
        "Donate": "Spende",
        "DonateSub": "Hilf mir, es am laufen zu halten.",
        "DonateExplanation": "{appName} schaltet keine werbung und wird auch niemals deine daten verkaufen, daher ist <span class=\"text-backdrop\">die nutzung völlig kostenlos</span>. aber es stellt sich heraus, dass die aufrechterhaltung eines webdienstes, der von tausenden von menschen genutzt wird, ziemlich kostspielig ist.\n\nwenn du {appName} nützlich findest und es online halten willst, oder einfach dem entwickler danken willst, solltest du einen beitrag leisten! jeder cent hilft und wird SEHR geschätzt.",
        "DonateVia": "Spenden via",
        "DonateHireMe": "alternativ kannst du mich auch <a class=\"text-backdrop italic\" href=\"{s}\" target=\"_blank\">beauftragen</a>.",
        "SettingsVideoMute": "Ton stummschalten",
        "SettingsVideoMuteExplanation": "Deaktiviert Ton im heruntergeladenen Video wenn möglich. Wird ignoriert, wenn der Audiomodus aktiv ist oder der Dienst nur Audio unterstützt.",
        "SettingsVideoGeneral": "allgemein",
        "ErrorSoundCloudNoClientId": "Konnte client_id nicht finden, die benötigt wird, um Audiodaten von Soundcloud zu laden. Versuche es noch einmal, und falls das Problem weiterhin besteht, {ContactLink}.",
        "CollapseServices": "unterstützte dienste",
        "CollapseSupport": "support & quellcode",
        "CollapsePrivacy": "datenschutzrichtlinie",
        "ServicesNote": "diese liste ist nicht vollständig und erweitert sich im laufe der zeit, denke daran nochmal nachzuschauen!",
        "FollowSupport": "folge {appName} auf mastodon oder twitter für support, umfragen, neuigkeiten, und mehr:",
        "SupportNote": "bitte beachte, dass das beantworten von fragen und fehlermeldungen eine weile dauert, es gibt nur eine Person die alles managed.",
        "SourceCode": "melde Probleme, erkundige den Quellcode, sterne oder forke das Repo:",
        "PrivacyPolicy": "{appName}s datenschutzrichtlinie ist einfach: keine deiner daten werden gesammelt oder gespeichter. null, nada, niente, nichts.\nwas du herunterlädst ist dein ding, nicht meins.\n\neinige nicht zurückverfolgbare daten werden vorübergehend gespeichert, wenn ein angeforderter download live rendering erfordert. das ist notwendig, damit diese funktion funktioniert.\n\nin diesem fall werden, <span class=\"text-backdrop\">der salted sha256 hash deiner ip-adresse</span> und informationen über den angeforderten stream temporär im RAM des servers für <span class=\"text-backdrop\">2 minutes</span> gespeichert. nach 2 minuten werden alle zuvor gespeicherten informationen dauerhaft gelöscht. der hash deiner ip-adresse wird verwendet, <span class=\"text-backdrop\">um den zugang zum stream auf dich zu beschränken</span>.\nniemand (nichtmals ich) hat zugriff auf diese daten, da die offizielle cobalt-codebasis keine möglichkeit bietet, sie außerhalb der verarbeitungsfunktionen zu lesen.\n\ndu kannst {appName}s <a class=\"text-backdrop italic\" href=\"{repo}\" target=\"_blank\">github repo</a> selbst überprüfen und sehen, dass tatsächlich nichts dauerhaft gespeichert wird."
    }
}
