{
    "name": "français",
    "substrings": {
        "ContactLink": "<a class=\"text-backdrop\" href=\"{repo}\" target=\"_blank\">fais-moi signe</a>"
    },
    "strings": {
        "LinkInput": "collez le lien ici",
        "AboutSummary": "{appName} est l'endroit idéal pour télécharger sur les réseaux sociaux. zero pubs, trackers, ou toute autre connerie effrayante attachée. il suffit de coller un lien de partage et vous êtes prêt à vous lancer!",
        "AboutSupportedServices": "services actuellement supportés:",
        "EmbedBriefDescription": "sauvegarder le contenu des médias sociaux sans être suivi par des personnes mal intentionnées",
        "MadeWithLove": "crée avec <3 par wukko et tous les contributeurs sur github (traduction par Greep)",
        "AccessibilityInputArea": "zone de saisie du lien",
        "AccessibilityOpenAbout": "ouvrir la fenêtre popup à propos",
        "AccessibilityDownloadButton": "bouton de téléchargement",
        "AccessibilityOpenSettings": "ouvrir la fenêtre popup des paramètres",
        "AccessibilityOpenChangelog": "voir la fenêtre popup du journal des modifications",
        "AccessibilityClosePopup": "fermer la popup",
        "AccessibilityOpenDonate": "ouvrir une popup de donation",
        "TitlePopupAbout": "c'est quoi {appName}?",
        "TitlePopupSettings": "paramètres",
        "TitlePopupError": "ah! c'est cringe là...",
        "TitlePopupChangelog": "Quoi de neuf ?",
        "TitlePopupDonate": "supporter {appName}",
        "TitlePopupDownload": "télecharger",
        "ErrorSomethingWentWrong": "quelque chose s'est mal passé et je n'ai rien pu obtenir pour vous. vous pouvez réessayer, mais si le problème persiste, s'il vous plaît {ContactLink}.",
        "ErrorUnsupported": "il semble que ce service ne soit pas encore supporté ou que votre lien ne soit pas valide.",
        "ErrorBrokenLink": "{s} est supporté, mais quelque chose ne va pas avec votre lien. peut-être que vous ne l'avez pas copié entièrement ?",
        "ErrorNoLink": "je ne peux pas deviner ce que vous voulez télécharger ! s'il vous plaît donnez-moi un lien.",
        "ErrorPageRenderFail": "quelque chose s'est mal passé et la page n'a pas pu s'afficher. Si c'est un problème récurrent ou critique, veuillez {ContactLink}. il serait utile de fournir le hash du commit actuel ({s}) et les étapes de recréation d'erreur. merci :D",
        "ErrorRateLimit": "vous faites beaucoup trop de demandes. calmez-vous et réessayez dans quelques minutes.",
        "ErrorCouldntFetch": "Impossible de récupérer les métadonnées. Vérifiez si votre lien est correct et réessayez.",
        "ErrorLengthLimit": "la durée limite actuelle est de {s} minutes. ce que vous avez essayé de télécharger est plus long que {s} minutes. choisissez autre chose à télécharger !",
        "ErrorBadFetch": "Quelque chose s'est mal passé avec la récupération des informations. Vous pouvez essayer un autre format et une autre résolution ou réessayer plus tard.",
        "ErrorCorruptedStream": "ce téléchargement est malheureusement corrompu. essayez à nouveau ou essayez un format et une résolution différents.",
        "ErrorNoInternet": "il n'y a pas d'internet ou l'api de {appName} est en panne. Vérifiez votre connexion et réessayez.",
        "ErrorCantConnectToServiceAPI": "je n'ai pas pu me connecter à l'api de {s}. il semble que {s} soit hors service ou que l'ip du serveur {appName} soit bloqué. réessayez plus tard.",
        "ErrorEmptyDownload": "il n'y a rien à télécharger. essayez autre chose !",
        "ErrorLiveVideo": "je ne peux pas télécharger une vidéo en direct. attendez que le flux se termine et réessayez.",
        "SettingsAppearanceSubtitle": "apparence",
        "SettingsThemeSubtitle": "thème",
        "SettingsFormatSubtitle": "télecharger le format",
        "SettingsMiscSubtitle": "plus de paramètres",
        "SettingsDownloadsSubtitle": "télechargement",
        "SettingsQualitySubtitle": "qualité",
        "SettingsThemeAuto": "auto",
        "SettingsThemeLight": "clair",
        "SettingsThemeDark": "sombre",
        "SettingsQualitySwitchMax": "max",
        "SettingsQualitySwitchHigh": "haute",
        "SettingsQualitySwitchMedium": "moyenne",
        "SettingsQualitySwitchLow": "basse",
        "SettingsQualitySwitchLowest": "plus basse",
        "SettingsKeepDownloadButton": "garder &gt;&gt; visible",
        "AccessibilityKeepDownloadButton": "garder le bouton de téléchargement toujours visible",
        "SettingsEnableDownloadPopup": "demander un moyen de sauvegarder",
        "AccessibilityEnableDownloadPopup": "demander ce qu'il faut faire avec les téléchargements",
        "SettingsFormatDescription": "sélectionnez webm si vous avez besoin de la qualité maximale disponible. les vidéos webm sont généralement de meilleure qualité mais les appareils ios ne peuvent pas les lire en natif.",
        "SettingsQualityDescription": "si la résolution choisie n'est pas disponible, la résolution la plus proche est choisie à la place. si vous voulez poster une vidéo youtube sur twitter, choisissez une combinaison de mp4 et 720p. twitter aime beaucoup plus les vidéos de ce type.",
        "DonateSubtitle": "aidez-moi à payer l'hébergement",
        "DonateDescription": "je n'aime pas vraiment la crypto dans son état actuel, mais c'est le seul moyen fiable pour moi de recevoir de l'argent et de payer quoi que ce soit à l'étranger.",
        "LinkGitHubIssues": "&gt;&gt; signaler les problèmes et consulter le code source sur github",
        "LinkGitHubChanges": "&gt;&gt; voir les changements précédents et contribuer sur github",
        "LinkDonateContact": "&gt;&gt; faites-moi savoir si la monnaie que vous voulez donner n'est pas listée",
        "NoScriptMessage": "{appName} utilise javascript pour les demandes d'api et l'interface interactive. vous devez autoriser javascript pour utiliser ce site. nous n'avons pas de publicités ou de traceurs, c'est promis.",
        "DownloadPopupDescriptionIOS": "comme vous avez un appareil ios, vous devez appuyer sur le bouton de téléchargement et le maintenir enfoncé, puis sélectionner \"télécharger la vidéo\" dans la fenêtre popup qui apparaît pour enregistrer la vidéo. cela sera nécessaire tant qu'apple imposera safari webview à tous les développeurs de navigateurs sur ios.",
        "DownloadPopupDescription": "le bouton de téléchargement ouvre un nouvel onglet avec le fichier demandé. vous pouvez désactiver cette popup dans les paramètres.",
        "DownloadPopupWayToSave": "choisissez un moyen de sauvegarder",
        "ClickToCopy": "appuyer pour copier",
        "Download": "télecharger",
        "CopyURL": "copier l'url",
        "AboutTab": "à propos",
        "ChangelogTab": "journal de modifications",
        "DonationsTab": "donations",
        "SettingsVideoTab": "vidéo",
        "SettingsAudioTab": "audio",
        "SettingsOtherTab": "autre",
        "ChangelogLastCommit": "dernier commit",
        "ChangelogLastMajor": "dernière mise à jour majeure",
        "AccessibilityModeToggle": "basculer le mode de téléchargement",
        "DonateLinksDescription": "les liens vers les dons s'ouvrent dans un nouvel onglet. c'est la meilleure façon de donner de l'argent, si vous voulez que je le reçoive directement.",
        "SettingsAudioFormatBest": "meilleure",
        "SettingsAudioFormatDescription": "lorsque le meilleur format est sélectionné, vous obtenez l'audio dans la meilleure qualité disponible, car l'audio est conservé dans son format d'origine. si vous sélectionnez autre chose, vous obtiendrez un fichier légèrement compressé.",
        "Keyphrase": "sauvegardez ce que vous aimez",
        "SettingsDisableChangelogOnUpdate": "ne pas afficher le journal de modifications après les mises à jour majeures",
        "SettingsRemoveWatermark": "désactiver le filigrane",
        "ErrorPopupCloseButton": "fermer",
        "ModeToggle": "mode",
        "ModeToggleSmart": "intélligent",
        "ErrorLengthAudioConvert": "la longueur limite actuelle pour la conversion audio est de {s} minutes. choisissez plutôt le format \"meilleure\" !",
        "SettingsAudioFullTikTok": "télécharger l'audio complet",
        "SettingsAudioFullTikTokDescription": "cet audio est le plus souvent de la musique ou un son original utilisé dans une vidéo. un audio sans voix off, tts, ou découpage sera téléchargé, s'il est disponible, bien sûr.",
        "ErrorCantGetID": "Je n'ai pas pu obtenir les informations complètes à partir du lien raccourci. Assurez-vous que cela fonctionne ou essayez un lien complet.",
        "ErrorNoVideosInTweet": "Ce tweet n'a pas de vidéos ou de gifs. Essayez un autre !",
        "ImagePickerTitle": "choisir les images à télécharger",
        "ImagePickerDownloadAudio": "Télécharger l'audio",
        "ImagePickerExplanationPC": "faites un clic droit sur une image pour l'enregistrer.",
        "ImagePickerExplanationPhone": "appuyez et maintenez une image enfoncée pour l'enregistrer.",
        "ErrorNoUrlReturned": "le serveur n'a pas retourné de lien de téléchargement. Cela ne devrait jamais se produire. Rechargez la page et réessayez, mais si cela n'aide pas, {ContactLink}.",
        "ErrorUnknownStatus": "J'ai reçu une réponse que je ne peux pas traiter. Il est fort probable que quelque chose avec le statut est erroné. cela ne devrait jamais arriver. Rechargez la page et réessayez, mais si cela n'aide pas, {ContactLink}."
    }
}
