{
    "name": "français",
    "substrings": {
        "ContactLink": "<a class=\"text-backdrop italic\" href=\"{repo}\" target=\"_blank\">créer un ticket sur github</a>"
    },
    "strings": {
        "LinkInput": "collez le lien ici",
        "AboutSummary": "{appName} est l'endroit idéal pour télécharger sur les réseaux sociaux. zero pubs, trackers, ou toute autre connerie effrayante attachée. il suffit de coller un lien de partage et vous êtes prêt à vous lancer!",
        "EmbedBriefDescription": "sauvegarder le contenu des médias sociaux sans être suivi par des personnes mal intentionnées",
        "MadeWithLove": "crée avec <3 par wukko et tous les contributeurs sur github (traduction par Greep)",
        "AccessibilityInputArea": "zone de saisie du lien",
        "AccessibilityOpenAbout": "ouvrir la fenêtre popup à propos",
        "AccessibilityDownloadButton": "bouton de téléchargement",
        "AccessibilityOpenSettings": "ouvrir la fenêtre popup des paramètres",
        "AccessibilityClosePopup": "fermer la popup",
        "AccessibilityOpenDonate": "ouvrir une popup de donation",
        "TitlePopupAbout": "c'est quoi {appName}?",
        "TitlePopupSettings": "paramètres",
        "TitlePopupError": "ah! c'est cringe là...",
        "TitlePopupChangelog": "Quoi de neuf ?",
        "TitlePopupDonate": "supporter {appName}",
        "TitlePopupDownload": "télecharger",
        "ErrorSomethingWentWrong": "quelque chose s'est mal passé et je n'ai rien pu obtenir pour vous. vous pouvez réessayer, mais si le problème persiste, s'il vous plaît {ContactLink}.",
        "ErrorUnsupported": "il semble que ce service ne soit pas encore supporté ou que votre lien ne soit pas valide.",
        "ErrorBrokenLink": "{s} est supporté, mais quelque chose ne va pas avec votre lien. peut-être que vous ne l'avez pas copié entièrement ?",
        "ErrorNoLink": "je ne peux pas deviner ce que vous voulez télécharger ! s'il vous plaît donnez-moi un lien.",
        "ErrorPageRenderFail": "quelque chose s'est mal passé et la page n'a pas pu s'afficher. Si c'est un problème récurrent ou critique, veuillez {ContactLink}. il serait utile de fournir le hash du commit actuel ({s}) et les étapes de recréation d'erreur. merci :D",
        "ErrorRateLimit": "vous faites trop de demandes. réessayez dans une minute!",
        "ErrorCouldntFetch": "impossible de récupérer les métadonnées de ton lien. vérifie s'il est correct et réessaye.",
        "ErrorLengthLimit": "la durée limite actuelle est de {s} minutes. ce que vous avez essayé de télécharger est plus long que {s} minutes. choisissez autre chose à télécharger !",
        "ErrorBadFetch": "Quelque chose s'est mal passé avec la récupération des informations. Vous pouvez essayer un autre format et une autre résolution ou réessayer plus tard.",
        "ErrorCorruptedStream": "ce téléchargement est malheureusement corrompu. essayez à nouveau ou essayez un format et une résolution différents.",
        "ErrorNoInternet": "il n'y a pas d'internet ou l'api de {appName} est en panne. Vérifiez votre connexion et réessayez.",
        "ErrorCantConnectToServiceAPI": "je n'ai pas pu me connecter à l'api de {s}. il semble que {s} soit hors service ou que l'ip du serveur {appName} soit bloqué. réessayez plus tard.",
        "ErrorEmptyDownload": "il n'y a rien à télécharger. essayez autre chose !",
        "ErrorLiveVideo": "je ne peux pas télécharger une vidéo en direct. attendez que le flux se termine et réessayez.",
        "SettingsAppearanceSubtitle": "apparence",
        "SettingsThemeSubtitle": "thème",
        "SettingsFormatSubtitle": "télecharger le format",
        "SettingsQualitySubtitle": "qualité",
        "SettingsThemeAuto": "auto",
        "SettingsThemeLight": "clair",
        "SettingsThemeDark": "sombre",
        "SettingsQualitySwitchMax": "max",
        "SettingsQualitySwitchHigh": "haute",
        "SettingsQualitySwitchMedium": "moyenne",
        "SettingsQualitySwitchLow": "basse",
        "SettingsQualitySwitchLowest": "plus basse",
        "SettingsKeepDownloadButton": "garder &gt;&gt; visible",
        "AccessibilityKeepDownloadButton": "garder le bouton de téléchargement toujours visible",
        "SettingsEnableDownloadPopup": "demander un moyen de sauvegarder",
        "AccessibilityEnableDownloadPopup": "demander ce qu'il faut faire avec les téléchargements",
        "SettingsFormatDescription": "sélectionne webm si tu as besoin de la qualité maximale disponible. les vidéos webm sont généralement de meilleure qualité mais les appareils ios ne peuvent pas les lire nativement.",
        "SettingsQualityDescription": "si la qualité sélectionnée n'est pas disponible, la plus proche sera choisie à sa place.\nsi tu veux publier une vidéo youtube sur les réseaux sociaux, sélectionne mp4 et 720p.",
        "LinkGitHubChanges": "&gt;&gt; voir les changements précédents et contribuer sur github",
        "NoScriptMessage": "{appName} utilise javascript pour les demandes d'api et l'interface interactive. vous devez autoriser javascript pour utiliser ce site. nous n'avons pas de publicités ou de traceurs, c'est promis.",
        "DownloadPopupDescriptionIOS": "appuyez et maintenez le bouton de téléchargement, masquez l'aperçu de la vidéo, puis sélectionnez \"télécharger le fichier lié\" pour enregistrer.",
        "DownloadPopupDescription": "le bouton de téléchargement ouvre un nouvel onglet avec le fichier demandé. vous pouvez désactiver cette popup dans les paramètres.",
        "DownloadPopupWayToSave": "choisissez un moyen de sauvegarder",
        "ClickToCopy": "appuyer pour copier",
        "Download": "télecharger",
        "CopyURL": "copier l'url",
        "AboutTab": "à propos",
        "ChangelogTab": "journal de modifications",
        "DonationsTab": "donations",
        "SettingsVideoTab": "vidéo",
        "SettingsAudioTab": "audio",
        "SettingsOtherTab": "autre",
        "ChangelogLastMajor": "version actuelle & commit",
        "AccessibilityModeToggle": "basculer le mode de téléchargement",
        "DonateLinksDescription": "les liens vers les dons s'ouvrent dans un nouvel onglet. c'est la meilleure façon de faire un don si vous voulez que je le reçoive directement.",
        "SettingsAudioFormatBest": "meilleure",
        "SettingsAudioFormatDescription": "lorsque le meilleur format est sélectionné, vous obtenez l'audio dans la meilleure qualité disponible, car il n'est pas réencodé. tout le reste sera ré-encodé.",
        "Keyphrase": "sauvegardez ce que vous aimez",
        "SettingsRemoveWatermark": "désactiver le filigrane",
        "ErrorPopupCloseButton": "fermer",
        "ErrorLengthAudioConvert": "la longueur limite actuelle pour la conversion audio est de {s} minutes. choisissez plutôt le format \"meilleure\" !",
        "SettingsAudioFullTikTok": "télécharger l'audio complet",
        "SettingsAudioFullTikTokDescription": "cet audio est le plus souvent de la musique ou un son original utilisé dans une vidéo. un audio sans voix off, tts, ou découpage sera téléchargé, s'il est disponible, bien sûr.",
        "ErrorCantGetID": "Je n'ai pas pu obtenir les informations complètes à partir du lien raccourci. Assurez-vous que cela fonctionne ou essayez un lien complet.",
        "ErrorNoVideosInTweet": "Ce tweet n'a pas de vidéos ou de gifs. Essayez un autre !",
        "ImagePickerTitle": "choisir les images à télécharger",
        "ImagePickerDownloadAudio": "Télécharger l'audio",
        "ImagePickerExplanationPC": "faites un clic droit sur une image pour l'enregistrer.",
        "ImagePickerExplanationPhone": "appuyez et maintenez une image enfoncée pour l'enregistrer.",
        "ErrorNoUrlReturned": "le serveur n'a pas retourné de lien de téléchargement. Cela ne devrait jamais se produire. Rechargez la page et réessayez, mais si cela n'aide pas, {ContactLink}.",
        "ErrorUnknownStatus": "J'ai reçu une réponse que je ne peux pas traiter. Il est fort probable que quelque chose avec le statut est erroné. cela ne devrait jamais arriver. Rechargez la page et réessayez, mais si cela n'aide pas, {ContactLink}.",
        "PasteFromClipboard": "coller à partir du presse-papiers",
        "ChangelogOlder": "versions précédentes",
        "ChangelogPressToExpand": "appuyer pour étendre",
        "Miscellaneous": "divers",
        "ModeToggleAuto": "mode automatique",
        "ModeToggleAudio": "mode audio",
        "SettingsDisableNotifications": "masquer les points de notification",
        "MediaPickerTitle": "choisir que télécharger",
        "MediaPickerExplanationPC": "cliquez ou faites un clic droit pour télécharger ce que vous voulez.",
        "MediaPickerExplanationPhone": "appuyez ou appuyez et maintenez pour télécharger ce que vous voulez.",
        "MediaPickerExplanationPhoneIOS": "appuyez et maintenez enfoncé, masquer l'aperçu, puis sélectionnez \"télécharger le fichier lié\" pour enregistrer.",
        "TwitterSpaceWasntRecorded": "cet espace twitter n'a pas été enregistré, il n'y a donc rien à télécharger. essaie un autre !",
        "ErrorCantProcess": "je n'ai pas pu traiter votre demande :(\nvous pouvez réessayer, mais si le problème persiste, veuillez {ContactLink}.",
        "ChangelogPressToHide": "appuyer pour minimiser",
        "Donate": "donner",
        "DonateSub": "aidez-moi à le maintenir",
        "DonateExplanation": "{appName} ne diffuse pas (et ne diffusera jamais) d'annonces ni ne vendra vos données. Son utilisation est donc <span class=\"text-backdrop\">entièrement gratuite</span>. mais il s'avère que le maintien d'un service Web utilisé par des milliers de personnes est quelque peu coûteux.\n\nsi vous avez déjà trouvé {appName} utile et que vous souhaitez le garder en ligne, ou si vous souhaitez simplement remercier le développeur, pensez à participer ! chaque centime aide et est TRÈS apprécié.",
        "DonateVia": "faire un don par",
        "DonateHireMe": "ou, comme alternative, vous pouvez <a class=\"text-backdrop italic\" href=\"{s}\" target=\"_blank\">m'engager</a>.",
        "SettingsVideoMute": "couper le son",
        "SettingsVideoMuteExplanation": "désactive l'audio dans la vidéo téléchargée lorsque cela est possible. ignoré lorsque le mode audio est activé ou que le service ne prend en charge que l'audio.",
        "SettingsVideoGeneral": "général",
        "ErrorSoundCloudNoClientId": "impossible de trouver client_id requis pour récupérer les données audio de soundcloud. réessayez, et si le problème persiste, {ContactLink}.",
        "CollapseServices": "services supportés",
        "CollapseSupport": "prise en charge et code source",
        "CollapsePrivacy": "politique de confidentialité",
        "ServicesNote": "cette liste n'est pas définitive et ne cesse de s'allonger avec le temps, assurez-vous de la consulter de temps en temps !",
        "FollowSupport": "suivez {appName} sur mastodon ou twitter pour obtenir de l'aide, des sondages, des actualités et bien plus :",
        "SupportNote": "veuillez noter que les questions et les problèmes peuvent prendre un certain temps pour répondre, il n'y a qu'une seule personne qui gère tout.",
        "SourceCode": "signalez les problèmes, explorez le code source, créez une étoile ou bifurquez le dépôt :",
        "PrivacyPolicy": "La politique de confidentialité de {appName} est simple : aucune donnée vous concernant n'est collectée ou stockée. zéro, zilch, nada, rien.\nce que vous téléchargez est votre affaire, pas la mienne.\n\ncertaines données non traçables sont temporairement stockées lorsque le téléchargement exigé nécessite un rendu en direct. il est nécessaire pour que cette fonctionnalité fonctionne.\n\ndans ce cas, le <span class=\"text-backdrop\">hachage sha256 salé de votre adresse IP</span> et les informations sur le flux exigé sont temporairement stockés dans la RAM du serveur pendant <span class=\"text-backdrop\">deux minutes</span>. après deux minutes, toutes les informations précédemment stockées sont définitivement supprimées. le hachage de votre adresse IP est <span class=\"text-backdrop\">utilisé pour limiter l'accès au flux uniquement pour vous</span>.\npersonne (même moi) n'a accès à ces données, car la base de code officielle du cobalt ne permet pas de les lire en dehors des fonctions de traitement.\n\nvous pouvez vérifier le <a class=\"text-backdrop italic\" href=\"{repo}\" target=\"_blank\">dépôt github</a> de {appName} par vous-même et voir qu'en effet rien n'est stocké de manière permanente."
    }
}
