{
    "name": "français",
    "substrings": {
        "ContactLink": "<a class=\"text-backdrop italic\" href=\"{repo}\" target=\"_blank\">ouvrir un ticket sur github</a>"
    },
    "strings": {
        "LinkInput": "collez le lien ici",
        "AboutSummary": "{appName} c'est ton QG pour choper les contenus venant des réseaux sociaux et plateformes médiatiques, sans pubs relou, traqueurs ou autres trucs  un peu chelou ! il te suffit de coller un lien de partage et paf, voilà ton média !",
        "EmbedBriefDescription": "enregistrez ce que vous aimez sans publicités, trackers, ou autres conneries effrayantes.",
        "MadeWithLove": "crée avec <3 par wukko et tous les contributeurs sur github (traduction par Greep)",
        "AccessibilityInputArea": "zone de saisie du lien",
        "AccessibilityOpenAbout": "ouvrir la fenêtre popup à propos",
        "AccessibilityDownloadButton": "bouton de téléchargement",
        "AccessibilityOpenSettings": "ouvrir la fenêtre popup des paramètres",
        "AccessibilityClosePopup": "fermer la popup",
        "AccessibilityOpenDonate": "ouvrir une popup de donation",
        "TitlePopupAbout": "c'est quoi {appName}?",
        "TitlePopupSettings": "paramètres",
        "TitlePopupError": "ah! c'est cringe là...",
        "TitlePopupChangelog": "quoi de neuf ?",
        "TitlePopupDonate": "supporter {appName}",
        "TitlePopupDownload": "où continuer ?",
        "ErrorSomethingWentWrong": "oups, un truc a raté et j'ai pas pu choper ce que tu voulais. essaie encore, mais si ça continue de bugger, {ContactLink}",
        "ErrorUnsupported": "on dirait que ce service n'est pas encore pris en charge ou que votre lien soit invalide. avez-vous collé le bon lien ?",
        "ErrorBrokenLink": "{s} est supporté, mais quelque chose ne va pas avec votre lien. peut-être que vous ne l'avez pas copié entièrement ?",
        "ErrorNoLink": "je ne peux pas deviner ce que vous voulez télécharger ! donnez-moi un lien :(",
        "ErrorPageRenderFail": "si tu lis ça, c'est qu'il y a un souci avec le moteur d'affichage de la page. stp, {ContactLink}. n'oublie pas de donner le nom de domaine où l'erreur se produit et le code de la version actuelle ({s}). merci d'avance ! :D",
        "ErrorRateLimit": "vous faites trop de demandes. réessayez dans une minute!",
        "ErrorCouldntFetch": "je n'ai rien trouvé à propos de ce lien. vérifiez s'il fonctionne et réessayez ! gardez à l'esprit que certains contenus peuvent être restreints.",
        "ErrorLengthLimit": "je ne peux pas traiter les vidéos de plus de {s} minutes, choisissez quelque chose de plus court !",
        "ErrorBadFetch": "euh un truc a raté quand j'ai essayé d'obtenir des infos sur ton lien. t'es sûr qu'il fonctionne ? vérifie si c'est le cas et réessaie",
        "ErrorNoInternet": "Il n'y a pas d'internet ou l'API de {appName} est en panne. Vérifiez votre connexion et réessayez.",
        "ErrorCantConnectToServiceAPI": "j'ai pas pu me connecter à l'api du service. ptet qu'il est en panne ou alors {appName} s'est fait bloquer. réessaie, mais si ça continue de bugger, {ContactLink}.",
        "ErrorEmptyDownload": "j'vois rien à télécharger avec ton lien… essaie-en un autre !",
        "ErrorLiveVideo": "c'est une vidéo en direct, j'ai pas encore appris à voir dans le futur. attends que le stream se termine et réessaie !",
        "SettingsAppearanceSubtitle": "apparence",
        "SettingsThemeSubtitle": "thème",
        "SettingsFormatSubtitle": "format",
        "SettingsQualitySubtitle": "qualité",
        "SettingsThemeAuto": "auto",
        "SettingsThemeLight": "clair",
        "SettingsThemeDark": "sombre",
        "SettingsKeepDownloadButton": "garder &gt;&gt; visible",
        "AccessibilityKeepDownloadButton": "garder le bouton de téléchargement toujours visible",
        "SettingsEnableDownloadPopup": "demander comment sauvegarder",
        "AccessibilityEnableDownloadPopup": "demander ce qu'il faut faire avec les téléchargements",
        "SettingsQualityDescription": "si la qualité sélectionnée n'est pas disponible, la plus proche sera utilisée à la place.",
        "LinkGitHubChanges": "&gt;&gt; voir les changements précédents et contribuer sur github",
        "NoScriptMessage": "{appName} utilise javascript pour les demandes d'api et l'interface interactive. vous devez autoriser javascript pour utiliser ce site. nous n'avons pas de publicités ou de trackers, c'est promis.",
        "DownloadPopupDescriptionIOS": "le moyen le plus simple d'enregistrer des vidéos sur ios:\n1. ajouter <a class=\"text-backdrop italic\" href=\"{saveToGalleryShortcut}\" target=\"_blank\">ce raccourci siri</a>.\n2. appuyez sur \"Partager\" ci-dessus et sélectionnez \"Enregistrer sur photos\" dans la feuille de partage apparu.\nsi demandé, vérifiez la demande de permission, et appuyez sur \"Toujours autoriser\".\n\nméthode alternative :\nappuyez et maintenez le bouton de téléchargement, masquez l'aperçu de la vidéo, et sélectionnez \"télécharger le fichier lié\" à télécharger.\nEnsuite, ouvrez les téléchargements de safari, sélectionnez le fichier que vous avez téléchargé, ouvrez le menu Partage et appuyez sur \"Enregistrer la vidéo\".",
        "DownloadPopupDescription": "le bouton de téléchargement ouvre un nouvel onglet avec le fichier demandé. vous pouvez désactiver cette popup dans les paramètres.",
        "DownloadPopupWayToSave": "choisissez un moyen de sauvegarder",
        "ClickToCopy": "appuyer pour copier",
        "Download": "télecharger",
        "CopyURL": "copier",
        "AboutTab": "à propos",
        "ChangelogTab": "journal de modifications",
        "DonationsTab": "donations",
        "SettingsVideoTab": "vidéo",
        "SettingsAudioTab": "audio",
        "SettingsOtherTab": "autre",
        "ChangelogLastMajor": "version actuelle & commit",
        "AccessibilityModeToggle": "basculer le mode de téléchargement",
        "DonateLinksDescription": "c'est la meilleure façon de faire un don si vous voulez que je le reçoive directement.",
        "SettingsAudioFormatBest": "meilleure",
        "SettingsAudioFormatDescription": "quand tu choisis le format \"meilleur\", tu récupères l'audio tel qu'il est côté service, sans réencodage. pour le reste, ça sera réencodé.",
        "Keyphrase": "sauvegardez ce que vous aimez",
        "SettingsRemoveWatermark": "désactiver le filigrane",
        "ErrorPopupCloseButton": "fermer",
        "ErrorLengthAudioConvert": "j'peux pas convertir des audios de plus de {s} minutes. choisis le format \"meilleur\" si tu veux éviter les limitations !",
        "SettingsAudioFullTikTok": "audio complet",
        "SettingsAudioFullTikTokDescription": "télécharge le son original utilisé dans la vidéo sans aucun changement supplémentaire par l'auteur du post.",
        "ErrorCantGetID": "Je n'ai pas pu obtenir les informations complètes à partir du lien raccourci. Assurez-vous que cela fonctionne ou essayez un lien complet! Si le problème persiste, {ContactLink}.",
        "ErrorNoVideosInTweet": "Je n'ai pas trouvé de contenu multimédia dans ce tweet. Essayez-en un autre !",
        "ImagePickerTitle": "choisir les images à télécharger",
        "ImagePickerDownloadAudio": "Télécharger l'audio",
        "ImagePickerExplanationPC": "faites un clic droit sur une image pour l'enregistrer.",
        "ImagePickerExplanationPhone": "appuyez et maintenez une image enfoncée pour l'enregistrer.",
        "ErrorNoUrlReturned": "Je n'ai pas reçu de lien de téléchargement du serveur. Cela ne devrait jamais arriver. Essayez à nouveau, mais si ça ne marche toujours pas, {ContactLink}.",
        "ErrorUnknownStatus": "j'ai reçu une réponse que je peux pas traiter. ça devrait jamais arriver. réessaie, mais si ça marche toujours pas, {ContactLink}.",
        "PasteFromClipboard": "coller et télécharger",
        "ChangelogOlder": "versions précédentes",
        "ChangelogPressToExpand": "agrandir",
        "Miscellaneous": "divers",
        "ModeToggleAuto": "mode automatique",
        "ModeToggleAudio": "mode audio",
        "SettingsDisableNotifications": "cacher les notifs",
        "MediaPickerTitle": "choisir que télécharger",
        "MediaPickerExplanationPC": "cliquez ou faites un clic droit pour télécharger ce que vous voulez.",
        "MediaPickerExplanationPhone": "appuyez ou appuyez et maintenez pour télécharger ce que vous voulez.",
        "MediaPickerExplanationPhoneIOS": "appuyez et maintenez enfoncé, masquer l'aperçu, puis sélectionnez \"télécharger le fichier lié\" pour enregistrer.",
        "TwitterSpaceWasntRecorded": "cet espace twitter n'a pas été enregistré, il n'y a donc rien à télécharger. essaie un autre !",
        "ErrorCantProcess": "je n'ai pas pu traiter votre demande :(\nvous pouvez réessayer, mais si le problème persiste, veuillez {ContactLink}.",
        "ChangelogPressToHide": "réduire",
        "Donate": "donner",
        "DonateSub": "aidez-moi à le maintenir",
        "DonateExplanation": "{appName} ne diffuse pas (et ne diffusera jamais) des pub ainsi que de vendre tes données, donc c'est <span class=\"text-backdrop\">totalement gratuit de l'utiliser</span>. mais il s'avère que développer et maintenir un service web utilisé par plus de 200 000 personnes, bah c'est dur.\n\nsi t'a trouvé {appName} pratique et que t'a envie d'aider à continuer son développement et son support, ou que t'a juste envi de remercier le developpeur, hésite pas a donner une petite pièce! chaque centime compte et ça serait SUPER cool de ta part :D\n\nen ce moment, j'ai un de gros projets (agrandissement), et j'ai besoin de ton aide. les gens utilise {appName} de plus en plus, et je dois compenser cette hausse. <span class=\"text-backdrop\">les dons seront donc encore plus appréciés que jamais.</span>\n\nje n'ai pour le moment rien gagné de {appName}, tout reviens aux utilisateurs, donc en faisant ça tu aiderait tout le monde ",
        "DonateVia": "faire un don par",
        "DonateHireMe": "...ou tu peux <a class=\"text-backdrop italic\" href=\"{s}\" target=\"_blank\">m'embaucher</a> :)",
        "SettingsVideoMute": "couper le son",
        "SettingsVideoMuteExplanation": "retire le son des vidéos téléchargées dès que possible",
        "ErrorSoundCloudNoClientId": "je n'ai pas pu récupérer le jeton temporaire nécessaire pour télécharger depuis soundcloud. réessayez, mais si le problème persiste, {ContactLink}.",
        "CollapseServices": "services supportés",
        "CollapseSupport": "prise en charge et code source",
        "CollapsePrivacy": "politique de confidentialité",
        "ServicesNote": "cette liste n'est pas définitive et ne cesse de s'allonger avec le temps, assurez-vous de la consulter de temps en temps !",
        "FollowSupport": "reste en contact avec {appName} pour obtenir de l'aide, des sondages, l'actu et bien plus encore :",
        "SupportNote": "veuillez noter que les questions et les problèmes peuvent prendre un certain temps pour répondre, il n'y a qu'une seule personne qui gère tout.",
        "SourceCode": "signalez les problèmes, explorez le code source, créez une étoile ou bifurquez le dépôt :",
        "PrivacyPolicy": "la politique de confidentialité de {appName} est super simple : aucune de vos données de sont collectées ni stockées. zero, niet, nada, rien.\n\nce que vous téléchargez ne me regarde pas, c'est tes affaires a toi seul.\n\nquelques données non-traçables sont tout de même stockées temporairement quand le téléchargement demandé nécessite un rendu en live. c'est pas ma faute, c'est nécessaire pour que ça fonctionne.\n\ndans ce cas, les infos par rapport au live sont temporairement stockées dans la RAM du serveur <span class=\"text-backdrop\">pendant 20 secondes</span>. une fois les 20 secondes passées, toutes les informations qui avaient été stockées sont supprimées de façon permanente.\n\npersonne (moi inclus) n'a accès a ces données, car le code de {appName} ne propose même pas de façon de lire ces données en dehors des fonctions de traitement.\n\nau pire, tu peux aller voir le <a class=\"text-backdrop italic\" href=\"{repo}\" target=\"_blank\">repo github</a> de {appName} par toi-même pour vérifier ça et voir que tout fonctionne comme décrit. ",
        "ErrorYTUnavailable": "cette vidéo youtube est inaccessible ou limitée à certaines catégories d'âge. je suis incapable de télécharger des vidéos avec du contenu sensible. réessayez avec un autre lien !",
        "ErrorYTTryOtherCodec": "je n'ai rien trouvé à télécharger avec vos paramètres. essayez un autre codec ou une autre qualité !\n\nnote : l'api youtube agit parfois bizarrement. jetez la faute à google pour ça, pas moi.",
        "SettingsCodecSubtitle": "codec youtube",
        "SettingsCodecDescription": "h264: généralement un meilleur support de lecteurs, mais la qualité est plafonnée à 1080p.\nav1: faible support de lecteurs, mais supporte la 8k & HDR.\nvp9: généralement le meilleur débit (bitrate), préserve la plupart des détails, supporte la 8k & HDR.\n\nchoisissez h264 si vous voulez la meilleure compartibilité pour les editeurs/lecteurs et les réseaux sociaux.",
        "SettingsAudioDub": "piste audio youtube",
        "SettingsAudioDubDescription": "définit quelle piste audio va être utilisée. si la piste doublée n'est pas disponible, le langage vidéo original est utilisé à la place.\n\noriginal : le langage vidéo original est utilisé.\nauto: le langage par défaut du navigateur (et {appName}) est utilisé.",
        "SettingsDubDefault": "original",
        "SettingsDubAuto": "auto",
        "SettingsVimeoPrefer": "type de téléchargement vimeo",
        "SettingsVimeoPreferDescription": "progressif: lien direct vers le cdn de vimeo. qualité max 1080p.\nprécipité : la vidéo et l'audio sont fusionnés par {appName} en un seul fichier. qualité max 4k.\n\nchoisissez \"progressif\" si vous voulez la meilleure compatibilité entre éditeur/lecteur/compatibilité réseaux sociaux. si le téléchargement progressif n'est pas disponible, précipité est utilisé à la place.",
        "ShareURL": "partager",
        "ErrorTweetUnavailable": "n'a pas pu trouver quoi que ce soit à propos de ce tweet. c'est peut-être parce que sa visibilité est limitée. ssaies-en un autre!",
        "UrgentUpdate6": "tous les problèmes de réseau ont été résolus !",
        "ErrorTwitterRIP": "twitter a restreint l'accès à tout contenu aux utilisateurs non authentifiés. il y a toujours un moyen d'obtenir des tweets de façon régulière, mais les espaces sont malheureusement impossibles à obtenir pour le moment. je suis à la recherche de solutions possibles.\n"
    }
}
