{
    "name": "engleski",
    "substrings": {
        "ContactLink": "<a class=\"text-backdrop italic\" href=\"{repo}\" target=\"_blank\">stvori issue na github</a>"
    },
    "strings": {
        "LinkInput": "zalijepi link ovdje",
        "AboutSummary": "{appName} je vaše mjesto za preuzimanje sa platforma sa socijalne medije. Bez reklama, tracker-a, ili ostalih špijunskih sranja. Samo zalijepite poveznicu i spremni ste!",
        "EmbedBriefDescription": "Spremi što voliš bez reklama, trackera ili ostalih špijunskih sranja.",
        "MadeWithLove": "napravljeno s <3 - wukko",
        "AccessibilityInputArea": "prostor za upis linka",
        "AccessibilityOpenAbout": "otvori popup \"o stranici\"",
        "AccessibilityDownloadButton": "gumb za preuzimanje",
        "AccessibilityOpenSettings": "otvori popup za postavke",
        "AccessibilityClosePopup": "zatvori popup\n",
        "AccessibilityOpenDonate": "otvori popup za donacije",
        "TitlePopupAbout": "što je {appName}?",
        "TitlePopupSettings": "postavke",
        "TitlePopupError": "jao...",
        "TitlePopupChangelog": "što je novo?",
        "TitlePopupDonate": "podrži {appName}",
        "TitlePopupDownload": "kako spremiti?",
        "ErrorSomethingWentWrong": "nešto je prošlo po zlu i nismo supjeli dobiti išta za vas. pokušaj ponovno, ali ako se problem ponavlja, {ContactLink}.",
        "ErrorUnsupported": "čini se kao da ova usluga nije još podržana ili je vaša poveznica neispravna. jeste li zaljepili ispravni link?",
        "ErrorBrokenLink": "{s} je podržan, ali nešto ne valja s tvojim linkom. možda ga nisi skroz kopirao?",
        "ErrorNoLink": "ne mogu pogoditi što želiš da preuzmem! molim te mi daj poveznicu :(",
        "ErrorPageRenderFail": "ako čitaš ovo, nešto je pošlo po zlu s tvojim prikazivačem stranice. molim te {ContactLink}. budi siguran da pružiš domenu na kojoj je ova greška i trenutačni hash commita ({s}). hvala unaprijed :D",
        "ErrorRateLimit": "radiš previše zahtjeva. pokušaj ponovno za minutu!",
        "ErrorCouldntFetch": "ne mogu pronaći ništa sa ove poveznice. provjerite radi li poveznica i pokušajte ponovno! no, molimo vas da imate na umu da neki sadržaj može biti regionalno restriktiran.",
        "ErrorLengthLimit": "Ne mogu obraditi videozapise duže od {s} minuta, pa molim vas izaberite nešto kraće!",
        "ErrorBadFetch": "nešto je pošlo po zlu kad sam pokušao dobiti informacije o tvojem linku. jesi li siguran da radi? provjeri radi li te pokušaj ponovno.",
        "ErrorNoInternet": "nema interneta ili je {appName} api privremeno nedostupan. provjeri vezu i pokušaj ponovno.",
        "ErrorCantConnectToServiceAPI": "ne mogu se spojiti na API servisa. možda je ugašen ili je {appName} blokirano. pokušajte ponovno, ali ako se greška ponavlja, {ContactLink}.",
        "ErrorEmptyDownload": "ne vidim što mogu preuzeti sa vaše poveznice. probajte neku drugu!",
        "ErrorLiveVideo": "ovo je live video, ja još moram naučiti kako gledati u budućnost. čekaj da stream završi i pokušaj ponovno!",
        "SettingsAppearanceSubtitle": "izgled",
        "SettingsThemeSubtitle": "tema",
        "SettingsFormatSubtitle": "format",
        "SettingsQualitySubtitle": "kvaliteta",
        "SettingsThemeAuto": "auto",
        "SettingsThemeLight": "svijetla",
        "SettingsThemeDark": "tamna",
        "SettingsKeepDownloadButton": "drži &gt;&gt; vidljivim",
        "AccessibilityKeepDownloadButton": "drži gumb za preuzimanje stalno vidljivim",
        "SettingsEnableDownloadPopup": "pitaj kako spremiti",
        "AccessibilityEnableDownloadPopup": "pitaj što raditi s preuzimanjima",
        "SettingsQualityDescription": "ako odabrana kvaliteta nije dostupna, najbliža je korištena.",
        "LinkGitHubChanges": "&gt;&gt; pogledaj ostale commitove i doprinosi na githubu",
        "NoScriptMessage": "{appName} koristi JavaScript za API requestove i interaktivno sučelje. morate dopustiti JavaScript da koristite ovu stranicu. Obećajem da nema prljavih skripta.",
        "DownloadPopupDescriptionIOS": "najlakši način spremanja videozapisa na ios-u:\n1. dodaj <a class=\"text-backdrop italic\" href=\"{saveToGalleryShortcut}\" target=\"_blank\">ovaj siri prečac</a>\n2. pritisni \"podijeli\" iznad i odaberi \"spremi u slike\" u tablici dijeljenja koja se pojavi.\nako pitan, pregledaj zahtjev dozvole i odaberi \"uvijek dopusti\".\n\nalternativna metoda:\npritisni i drži gumb za preuzimanje, sakrij pretpregled videozapisa i odaberi \"preuzmi datoteku s poveznice\" za preuzimanje.\nonda otvori safari preuzimanja, odaberi preuzetu datoteku, otvori meni za dijeljenje i napokon pritisni \"spremi videozapis\".",
        "DownloadPopupDescription": "gumb za preuzimanje otvara novu karticu s zatraženom datotekom. možeš onemogućiti ovaj popup u postavkama.",
        "ClickToCopy": "pritisni za kopiranje",
        "Download": "preuzmi",
        "CopyURL": "kopiraj",
        "AboutTab": "o stranici",
        "ChangelogTab": "changelog",
        "DonationsTab": "donacije",
        "SettingsVideoTab": "video",
        "SettingsAudioTab": "zvuk",
        "SettingsOtherTab": "ostalo",
        "ChangelogLastMajor": "trenutačna verzija i commit (na engleskom)",
        "AccessibilityModeToggle": "promijeni način preuzimanja",
        "DonateLinksDescription": "ovo je najbolji način za donirati ako želite da primim donaciju direktno",
        "SettingsAudioFormatBest": "najbolji",
        "SettingsAudioFormatDescription": "kada je \"najbolje\" format izabran, primiti ćete audio na način kakav je sa strane servisa. nije ponovno enkodirano. sve ostalo je biti ponovno enkodirano.",
        "Keyphrase": "spremi što voliš",
        "SettingsRemoveWatermark": "onemogući watermark",
        "ErrorPopupCloseButton": "kužim",
        "ErrorLengthAudioConvert": "ne mogu napraviti konverziju zvuka dužeg od {s} minuta. izaberite \"najbolje\" format ako želite izbjeći ograničenja!",
        "SettingsAudioFullTikTok": "cijeli zvuk",
        "SettingsAudioFullTikTokDescription": "preuzima originali zvuk koji je korišten u videozapisu bez dodatnih promjena sa strane autora objave.",
        "ErrorCantGetID": "nisam mogao dobiti punu informaciju od skraćene poveznice. pazite da radi ili probajte punu poveznicu! ako se problem ponovi, {ContactLink}.",
        "ErrorNoVideosInTweet": "nisam mogao pronaći nikakav medijski sadržaj u ovom tweetu. pokušaj neki drugi!",
        "ImagePickerTitle": "odaberi slike za preuzimanje",
        "ImagePickerDownloadAudio": "preuzmi zvuk",
        "ImagePickerExplanationPC": "desni klik na sliku kako bi ju spremio.",
        "ImagePickerExplanationPhone": "pritisni i drži sliku kako bi ju spremio.",
        "ErrorNoUrlReturned": "nisam dobio poveznicu za preuzimanje od ovog servera. ovo se nikad ne bi trebalo dogoditi. pokušajte ponovno, ali ako još uvijek ne radi, {ContactLink}.",
        "ErrorUnknownStatus": "dobio sam odgovor koji ne mogu obraditi. ovo se nikad ne bi trebalo dogoditi. pokušaj ponovno, ali ako i dalje ne radi, {ContactLink},",
        "PasteFromClipboard": "zalijepi i preuzmi",
        "ChangelogOlder": "prethodne verzije (na engleskom)",
        "ChangelogPressToExpand": "proširi",
        "Miscellaneous": "ostalo",
        "ModeToggleAuto": "auto način",
        "ModeToggleAudio": "zvučni način",
        "SettingsDisableNotifications": "sakri notifikacije",
        "MediaPickerTitle": "odaberi što spremiti",
        "MediaPickerExplanationPC": "klik ili desni klik kako bi preuzeo što želiš.",
        "MediaPickerExplanationPhone": "pritisni i drži kako bi preuzeo što želiš.",
        "MediaPickerExplanationPhoneIOS": "pritisni i držni, skrij pretpregled i onda odaberi \"download linked file\" za spremanje.",
        "TwitterSpaceWasntRecorded": "ovaj twitter space nije bio snimljen, pa nema ničega za preuzeti. pokušajte neki drugi!",
        "ErrorCantProcess": "nisam mogao obraditi vaš zahtjev :(((((\nmožete probati ponovno, ali ako se problem ponavlja, molimo vas {ContactLink}.",
        "ChangelogPressToHide": "sklopi",
        "Donate": "doniraj",
        "DonateSub": "pomozi da ostane online",
        "DonateExplanation": "{appName} ne prikazuje oglase i ne prodaje tvoje podatke (te nikad neće) što znači da je <span class=\"text-backdrop\">potpuno besplatan za korištenje</span>. na kraju se čini da razvijanje i održavanje web servisa kojeg koristi više od 300000 ljudi nije toliko lagano.\n\nako ti je {appName} ikad bio koristan i želiš kontribuirati njegovom razvoju i održavanju, razmisli o dobacivanju nešto pomoći! ako želiš zahvaliti razvijatelju, to možeš napraviti i preko donacija. svaka centa pomaže i VRLO je cijenjena.\n\nkorišitenje {appName}a preko cijelog svijeta dnevno raste i moram to nekako nadoknaditi. kako možeš zamisliti, troškovi hostanja također rastu. kao prvogodišnji student sveučilišta, nisam bio spreman za ovakve troškove :(\n\njoš moram zaraditi nešto od {appName}a; sve se vraća korisnicima pa tako pomažeš svakome tko koristi {appName}.\n\n<span class=\"text-backdrop\">tvoja pomoć se cijeni više nego ikad!</span>",
        "DonateVia": "doniraj preko",
        "DonateHireMe": "...ili me možeš <a class=\"text-backdrop italic\" href=\"{s}\" target=\"_blank\">zaposliti</a> :)",
        "SettingsVideoMute": "ugasi zvuk",
        "SettingsVideoMuteExplanation": "miče zvuk sa preuzetih videozapisa gdje moguće.",
        "ErrorSoundCloudNoClientId": "nisam uspio dobiti privremeni token koji je potreban za preuzeti pjesme sa SoundCloud-a. pokušajte ponovno, ali ako se problem ponavlja, {ContactLink}.",
        "CollapseServices": "podržani servisi",
        "CollapseSupport": "podrška i izvorni kod",
        "CollapsePrivacy": "politika privatnosti",
        "ServicesNote": "ova lista nije finalna i preko vremena se povećava, zato svakako provjerite svako malo!",
        "FollowSupport": "ostani u kontaktu s {appName}om za podršku, ankete, novosti i više:",
        "SupportNote": "molimo uzmite u obzir da pitanja i problemi možda trebaju duže da dobiju odgovor, tamo je samo jedna osoba koja upravlja svime.",
        "SourceCode": "prijavite probleme, istražite source code, dodajte zvijezdu ili forkajte repo:",
        "PrivacyPolicy": "{appName}ova politika privatnosti je jednostavna: nikakvi podatci o tebi se skupljaju niti spremaju. nula, ništa, nikaj, njet.\nšto preuzimaš je tvoj posao, ne moj.\n\nneki podatci koji se ne mogu pratiti nazad do tebe se privremeno spremaju kad zatraženo preuzimanje zahtjeva live render. potrebni su za kako bi ta značajka funkcionirala.\n\nu tom slučaju, informacije o zatraženom streamu su privremeno spremljene u RAM-u servera <span class=\"text-backdrop\">20 sekundi</span>. nakon što tih 20 sekundi prođe, sve prethodno spremljene informacije su trajno izbrisane.\nnitko (ni ja) nema pristup ovim podatcima, jer službeni {appName} codebase ne pruža način da se čitaju izvan funkcija procesiranja.\n\nmožeš sam provjeriti {appName}ov <a class=\"text-backdrop italic\" href=\"{repo}\" target=\"_blank\">github repo</a> i vidjeti da je sve kao navedeno.",
        "ErrorYTUnavailable": "ovaj youtube video je nedostupan; možda je dobno ili regijski ograničen. probaj neki drugi!",
        "ErrorYTTryOtherCodec": "nisam mogao naći ništa za preuzeti s tvojim postavkama. probaj drugi kodek ili kvalitetu!\n\nbilješka: youtube api nekad reagira neočekivano. krivi google za ovo, ne mene.",
        "SettingsCodecSubtitle": "youtube kodek",
        "SettingsCodecDescription": "h264: sveukupna bolja podrška za video playere, ali kvaliteta ne ide dalje od 1080p.\nav1: loša podrška za playere, ali podržava 8k i HDR.\nvp9: inače najviši bitrate, zadržava najviše detalja. podržava 4k i HDR.\n\nodaberi h264 ako želiš najbolji kompabilitet sa video playerima/video uređivačima/socijalnim medijima.",
        "SettingsAudioDub": "youtube audio snimka",
        "SettingsAudioDubDescription": "definira koji će se audiozapis koristiti. ako sinkroniziran audiozapis nije dostupan, originalni jezik videozapisa će se koristiti umjesto toga.\n\noriginalni: originalni jezik videozapisa će se koristiti umjesto toga.\nautomatski: zadani jezik web preglednika (i {appName}a) će se koristiti.",
        "SettingsDubDefault": "originalni",
        "SettingsDubAuto": "auto",
        "SettingsVimeoPrefer": "tip vimeo preuzimanja",
        "SettingsVimeoPreferDescription": "progresivan: direktan link do vimeovog cdn-a. maksimalna kvaliteta je 1080p.\ndash: video i audio su spojeni od strane {appName}a u jednu datoteku. maksimalna kvaliteta je 4k.\n\nodaberi \"progresivan\" ako želiš najbolji kompabilitet sa video uređivačima/video playerima/socijalnim medijima. ako progresivno preuzimanje nije moguće, dash se koristi.",
        "ShareURL": "podijeli",
        "ErrorTweetUnavailable": "nisam mogao naći ništa o ovom tweetu. možda je tako jer je vidljivost tog tweeta ograničena. pokušaj neki drugi!",
        "ErrorTwitterRIP": "twitter ima ograničeni pristup bilo kojem sadržaju neautenticiranim korisnicima. iako postoji način da se dobiju obični tweetovi, spaceve je, nažalost, nemoguće trenutno dobiti. gledam u moguća rješenja.",
        "UrgentDonate": "{appName} treba tvoju pomoć!",
        "PopupCloseDone": "gotovo"
    }
}
