{
    "name": "Norwegian",
    "code": "no",
    "substrings": {
        "ContactLink": "<a class=\"text-backdrop\" href=\"{repo}\" target=\"_blank\">ta kontakt</a>"
    },
    "strings": {
        "ChangelogContentTitle": "everything what you've been waiting for. welcome to cobalt 3.0 :)",
        "ChangelogContent": "follow cobalt's twitter account for polls, updates, and more: <a class=\"text-backdrop\" href=\"https://twitter.com/justusecobalt\" target=\"_blank\">@justusecobalt</a>\n\nstuff that you can notice:\n\n- you can now download audio from any supported service, in any format that you set in settings (+). yes, that includes mp3, which you all have been waiting for :D\n- it's now easier to switch between download modes (just a single toggle on the bottom).\n- your youtube download format has been reset, sorry, but that was required to implement all audio downloads.\n- default download format for youtube videos on all platforms is now webm. except for ios.\n\n- cobalt now has emoji, just to spice up the black and white ui. all of them have been tuned to look the best in both themes. isn't it cool?\n- about, changelog, and donation popups have been merged into just one, for covnenience.\n- changelog got a huge upgrade (as you can see), and now there are both major changes and latest commit info, just so commits can finally go back to being batshit insane.\n- changelog popup appears on every major update, but you can disable it in settings, if you want to.\n- changelog now opens by default when pressing \"?\" button. i don't think anyone reads \"about\" as often.\n- settings (+) have been split into three tabs, also for convenience and ease of use.\n\n- added support for donation links. you can now donate through boosty, not only via crypto :D\n- donate popup has been rearranged and tuned just a tiny bit. \n\n- you can now click away from any popup by pressing the void behind it.\n- you can also press \"escape\" key on keyboard to close any popup.\n\n- switchers and buttons are now way easier on eye. white border is gone from where it's unneeded.\n- buttons are now very satisfying to press.\n- switchers are scrollable if there's not enough space to fit all contents on screen.\n- scaling is now even better than before.\n\ninternal stuff:\n\n- frontend won't send video related stuff if audio mode is on.\n- matching has, yet again, gone through mitosis, and is now probably the cleanest it can get.\n- page rendering is now modular, something like what frameworks have but way lighter. this makes adding new features WAY easier.\n- removed some stuff that didn't make sense (like storing language of stream request).\n- cleaned up insides of cobalt, of course.\n- almost all links now open in new tab, just like they should have from the very beginning.\n\nknown issues:\n- impossible to download audio from vk. i'll try to fix it in the next update.\n- headers are not sticky in tabbed popups. maybe this is a good thing, i'll think about it.\n\nif you ever notice any issues, make sure to report them on github. your report doesn't have to sound professional, just do your best to describe the issue.",
        "LinkInput": "lim inn lenken her",
        "AboutSummary": "{appName} er stedet for sosiale medier for nedlastinger. ingen reklame, sporere eller andre skumle ting tilknyttet. bare lim inn en delinglenke, og du er klar til å rocka!",
        "AboutSupportedServices": "følgende tjenester støttes for øyeblikket:",
        "EmbedBriefDescription": "lagre innhold fra sosiale medier uten at rare folk følger deg",
        "MadeWithLove": "laget med <3 av wukko",
        "AccessibilityInputArea": "link inputområde",
        "AccessibilityOpenAbout": "åpne om-popup",
        "AccessibilityDownloadButton": "nedlastingsknapp",
        "AccessibilityOpenSettings": "åpne innstillinger popup",
        "AccessibilityOpenChangelog": "vis endringslogg popup",
        "AccessibilityClosePopup": "lukk popup-en",
        "AccessibilityOpenDonate": "åpne donasjonspopup",
        "TitlePopupAbout": "hva er {appName}?",
        "TitlePopupSettings": "innstillinger",
        "TitlePopupError": "Huffa meg...",
        "TitlePopupChangelog": "hva er nytt?",
        "TitlePopupDonate": "støtt {appName}",
        "TitlePopupDownload": "nedlasting",
        "ErrorSomethingWentWrong": "noe gikk galt, og jeg kunne ikke finne fram noe til deg. du kan prøve igjen, men hvis problemet fortsetter, vennligst {ContactLink}.",
        "ErrorUnsupported": "det ser ut som denne tjenesten ikke støttes enda, eller lenken er ugyldig.",
        "ErrorBrokenLink": "{s} støttes, men noe er galt med lenken din. kanskje du ikke kopierte den fullt ut?",
        "ErrorNoLink": "jeg kan ikke gjette hva du ønsker å laste ned! vennligst gi meg en lenke.",
        "ErrorPageRenderFail": "noe gikk galt, og siden kunne ikke rendres. hvis det er et tilbakevendende eller kritisk problem, vennligst {ContactLink}. det ville være nyttig hvis du ga nåværende hash ({s}) og feil gjenskapelses trinn. takk :D",
        "ErrorRateLimit": "du forsøker å gjøre for mange forespørsler. ro ned og prøv igjen om et par minutter.",
        "ErrorCouldntFetch": "kunne ikke hente metadata. sjekk om lenken er riktig, og prøv igjen.",
        "ErrorLengthLimit": "gjeldende lengdebegrensning er {s} minutter. det du forsøkte å laste ned var lengre enn {s} minutter. velg noe annet å laste ned!",
        "ErrorBadFetch": "noe gikk galt med infohenting. du kan prøve et annet format og oppløsning, eller bare prøve igjen senere.",
        "ErrorCorruptedStream": "denne nedlastingen er dessverre ødelagt. prøv igjen eller prøv et annet format og oppløsning.",
        "ErrorNoInternet": "det er ingen internett, eller {appName} api er nede. sjekk forbindelsen din, og prøv igjen.",
        "ErrorCantConnectToServiceAPI": "jeg kunne ikke koble til {s} api. det virker som om enten {s} er nede, eller {appName} sin server ip er blokkert. prøv igjen senere.",
        "ErrorEmptyDownload": "det er ikke noe å laste ned. prøv noe annet!",
        "ErrorLiveVideo": "jeg kan ikke laste ned et direktesendt video. vent til strømmen er avsluttet, og prøv igjen.",
        "ErrorNoStreamID": "det er ingen slik streamId.",
        "ErrorNoType": "det er ingen slik forventet respons type.",
        "SettingsAppearanceSubtitle": "utseende",
        "SettingsThemeSubtitle": "tema",
        "SettingsFormatSubtitle": "nedlastingsformat",
        "SettingsMiscSubtitle": "flere innstillinger",
        "SettingsDownloadsSubtitle": "nedlastinger",
        "SettingsQualitySubtitle": "kvalitet",
        "SettingsThemeAuto": "auto",
        "SettingsThemeLight": "lys",
        "SettingsThemeDark": "mørk",
        "SettingsQualitySwitchMax": "maks",
        "SettingsQualitySwitchHigh": "høy\n",
        "SettingsQualitySwitchMedium": "middels\n",
        "SettingsQualitySwitchLow": "lav\n",
        "SettingsQualitySwitchLowest": "lavest",
        "SettingsFormatSwitchAudio": "bare lyd",
        "SettingsKeepDownloadButton": "behold &gt;&gt; synlig",
        "AccessibilityKeepDownloadButton": "behold nedlastingsknappen alltid synlig",
        "SettingsEnableDownloadPopup": "spør om måte å lagre på",
        "AccessibilityEnableDownloadPopup": "spør hva du skal gjøre med nedlastinger",
        "SettingsFormatDescription": "velg webm hvis du trenger maks tilgjengelig kvalitet. webm-videoer er vanligvis høyere kvalitet, men ios-enheter kan ikke spille dem direkte. ",
        "SettingsQualityDescription": "hvis valgt oppløsning ikke er tilgjengelig, plukkes den nærmeste. hvis du vil poste en youtube-video på twitter, velger du en kombinasjon av mp4 og 720p. twitter liker videoer på den måten mye mer.",
        "DonateSubtitle": "hjelp meg å betale for hosting",
        "DonateDescription": "jeg liker virkelig ikke krypto i dets nåværende tilstand, men det er den eneste pålitelige måten for meg å motta penger på og betale for noe utenfor landet.",
        "LinkGitHubIssues": "&gt;&gt; rapporter problemer og sjekk ut kildekoden på github",
        "LinkGitHubChanges": "&gt;&gt; se tidligere endringer og bidra på github",
        "LinkDonateContact": "&gt;&gt; gi beskjed hvis valutaen du ønsker å donere ikke er listet",
        "NoScriptMessage": "Bruker javascript for API-forespørsler og interaktivt grensesnitt. Du må tillate javascript for å bruke denne siden. Vi har ingen annonser eller sporere, kors på halsen.",
        "DownloadPopupDescriptionIOS": "siden du har et iOS-enhet, må du trykke og holde nedlastingsknappen, og deretter velge \"laste ned video\" i dukket opp popup for å lagre videoen. Dette vil være påkrevd så lenge Apple tvinger Safari webvisning på alle nettleserutviklere på iOS.",
        "DownloadPopupDescription": "nedlastingsknappen åpner en ny fane med forespurt fil. Du kan deaktivere denne popup-vinduet i innstillingene.",
        "DownloadPopupWayToSave": "velg en måte å lagre",
        "ClickToCopy": "klikk for å kopiere",
        "Download": "nedlasting",
        "CopyURL": "kopier url",
        "AboutTab": "om",
        "ChangelogTab": "endringslogg",
        "DonationsTab": "donasjoner",
        "SettingsVideoTab": "video",
        "SettingsAudioTab": "audio",
        "SettingsOtherTab": "annet",
        "ChangelogLastCommit": "last commit (in english)",
        "ChangelogLastMajor": "last major update (in english)",
        "ModeToggleDefault": "smart modus",
        "AccessibilityModeToggle": "toggle nedlastingsmodus",
        "DonateLinksDescription": "donasjonslenker åpnes i en ny fane. Dette er den beste måten å donere penger, hvis du vil at jeg skal motta dem direkte.",
        "SettingsAudioFormatBest": "best",
        "SettingsAudioFormatDescription": "når det beste formatet er valgt, får du lyd i best mulig kvalitet, fordi lyden beholdes i sitt opprinnelige format. Hvis du velger noe annet enn det, vil du få en litt komprimert fil.",
        "Keyphrase": "lagre det du elsker",
        "SettingsDisableChangelogOnUpdate": "ikke vis endringsloggen etter store oppdateringer"
    }
}