{
    "name": "engleză",
    "substrings": {
        "ContactLink": "<a class=\"text-backdrop italic\" href=\"{repo}\" target=\"_blank\">Depune o problemă pe GitHub</a>"
    },
    "strings": {
        "LinkInput": "inserați link-ul aici",
        "AboutSummary": "{appName} este destinația ta pentru descărcări de pe rețele de socializare. fără reclame, trackere, sau orice alte prostii. simplu inserează un link distribuit si ești gata de descărcare!",
        "EmbedBriefDescription": "salvează conținut de pe rețele de socializare fără întreruperi",
        "MadeWithLove": "făcut de <3 de wukko",
        "AccessibilityInputArea": "spațiu pentru link",
        "AccessibilityOpenAbout": "deschide fără fereastră nouă",
        "AccessibilityDownloadButton": "buton descărcare",
        "AccessibilityOpenSettings": "deschide fereastră setări",
        "AccessibilityClosePopup": "inchide-ți fereastra",
        "AccessibilityOpenDonate": "deschideți fereastră donații",
        "TitlePopupAbout": "ce este {appName}?",
        "TitlePopupSettings": "setări",
        "TitlePopupError": "hopa...",
        "TitlePopupChangelog": "ce este nou?",
        "TitlePopupDonate": "suportați {appName}",
        "TitlePopupDownload": "descărcați",
        "ErrorSomethingWentWrong": "ceva a mers greșit si nu am putut sa obțin nimic pentru dumneavoastră. pute-ți sa încercați din nou, dar dacă această problemă persistă, vă rog contactați {ContactLink}",
        "ErrorUnsupported": "se pare că această rețea nu este suportată încă sau linkul dumneavoastră nu este valid.",
        "ErrorBrokenLink": "{s} este suportat, dar este ceva greșit cu link-ul dumneavoastră, poate nu l-ați copiat bine?",
        "ErrorNoLink": "nu pot să ghicesc ce vreți sa descărcați! vă rog dați-mi un link!",
        "ErrorPageRenderFail": "ceva nu a mers bine si pagina nu a putut să fie redată. dacă asta e o problemă recurentă sau critică, vă rog contactați {ContactLink}.  ar fi foarte folositor dacă a-ți da comiterea hash curentă {s} și pașii de recreare a erorii. vă mulțumim în avans :D",
        "ErrorRateLimit": "Faci prea multe cereri. Încearcă din nou într-un minut!",
        "ErrorCouldntFetch": "Nu s-au putut obține informații despre link-ul tău. Verifică dacă este corect și încearcă din nou.",
        "ErrorLengthLimit": "limita de durată curentă este de {s} minute. videoclipul pe care l-ați ales durează mai mult de {s} minute. alege-ți altceva",
        "ErrorBadFetch": "A apărut o eroare atunci când s-a încercat obținerea de informații despre link-ul tău. Ești sigur că funcționează? Verifică dacă funcționează și încearcă din nou.",
        "ErrorCorruptedStream": "această descărcare este din păcate coruptă. încearcă din nou!",
        "ErrorNoInternet": "nu aveți internet sau API-ul {appName} este oprit. verificați conexiunea și încercați din nou",
        "ErrorCantConnectToServiceAPI": "nu m-am putut conecta la serviciul api. se poate sa fie offline, sau {appName} ar fi blocat. încearcă din nou puțin mai târziu!",
        "ErrorEmptyDownload": "nu văd nimic care ar putea fi descărcat de aici. încercați un link diferit.",
        "ErrorLiveVideo": "acesta este un videoclip live, încă nu am învățat cum să văd viitorul. așteptați ca fluxul să se termine și să încercați din nou!",
        "SettingsAppearanceSubtitle": "aparență",
        "SettingsThemeSubtitle": "temă",
        "SettingsFormatSubtitle": "format",
        "SettingsQualitySubtitle": "calitate",
        "SettingsThemeAuto": "auto",
        "SettingsThemeLight": "luminos",
        "SettingsThemeDark": "întunecat",
        "SettingsKeepDownloadButton": "păstrază &gt;&gt; vizibil",
        "AccessibilityKeepDownloadButton": "păstrează butonul de descărcare mereu vizibil",
        "SettingsEnableDownloadPopup": "cere un mod de a salva",
        "AccessibilityEnableDownloadPopup": "cere ce să facem cu descărcările",
        "SettingsQualityDescription": "în cazul în care calitatea selectată nu este disponibilă, cea mai apropiată este folosită în schimb.",
        "LinkGitHubChanges": "&gt;&gt; vezi comitele anterioare si contribuie pe github",
        "NoScriptMessage": "{appName} Folosește JavaScript pentru cereri API și interfața interactivă. Trebuie să permiți JavaScript pentru a folosi acest site. Nu am reclame sau trackere, promit pe degetul mic.",
        "DownloadPopupDescriptionIOS": "Apăsați și țineți apăsat butonul de descărcare, ascundeți previzualizarea video, apoi selectați \"download linked file\" pentru a salva.",
        "DownloadPopupDescription": "Butonul de descărcare deschide o filă nouă cu fișierul solicitat. Puteți dezactiva acest pop-up în setări.",
        "DownloadPopupWayToSave": "Alege un mod de a salva",
        "ClickToCopy": "Apăsaţi pentru a copia",
        "Download": "descărcați",
        "CopyURL": "Copiază URL",
        "AboutTab": "Despre",
        "ChangelogTab": "Istoric modificări",
        "DonationsTab": "Donații",
        "SettingsVideoTab": "Video",
        "SettingsAudioTab": "Audio",
        "SettingsOtherTab": "Altele",
        "ChangelogLastMajor": "Versiunea curentă & commit-uri",
        "AccessibilityModeToggle": "Comută modul de descărcare",
        "DonateLinksDescription": "Linkurile de donație se deschid într-o filă nouă. Acesta este cel mai bun mod de a dona dacă vrei să primesc donația ta direct.",
        "SettingsAudioFormatBest": "foarte bun",
        "SettingsAudioFormatDescription": "când formatul foarte bun este selectat, vei primi audio la cea mai bună calitate disponibilă, dacă nu este recodificat. toate celelalte vor fi recodificate.",
        "Keyphrase": "salvează ceea ce îți place",
        "SettingsRemoveWatermark": "dezactivează watermark",
        "ErrorPopupCloseButton": "am înțeles",
        "ErrorLengthAudioConvert": "limita de lungime curentă pentru conversia audio este de {s} minute. alegeți formatul \"foarte bun\" dacă doriți să evitați limitările.",
        "SettingsAudioFullTikTok": "descarcă audio complet",
        "SettingsAudioFullTikTokDescription": "descarcă sunetul original sau sunetul folosit în video fără modificări suplimentare din partea autorului video.",
        "ErrorCantGetID": "nu am putut obține toate informațiile din link-ul scurtat. asigurați-vă că funcționează sau încercați unul complet.",
        "ErrorNoVideosInTweet": "nu am putut găsi videoclipuri sau gif-uri pe acest tweet. încearcă altul!",
        "ImagePickerTitle": "alege imaginile de descărcat",
        "ImagePickerDownloadAudio": "descarcă audio",
        "ImagePickerExplanationPC": "Click dreapta pe o imagine pentru a o salva.",
        "ImagePickerExplanationPhone": "Apăsați și țineți apăsată o imagine pentru a o salva.",
        "ErrorNoUrlReturned": "serverul nu a returnat un link de descărcare. Acest lucru nu ar trebui să se întâmple niciodată. reîncărcaţi pagina şi încercaţi din nou, dar dacă nu ajută, {ContactLink}.",
        "ErrorUnknownStatus": "Am primit un răspuns ce nu pot procesa. Cel mai probabil ceva cu statutul este greșit. Acest lucru nu ar trebui să se întâmple niciodată. Reîncărcați pagina și încercați din nou, dar dacă nu ajută, {ContactLink}.",
        "PasteFromClipboard": "Inserați din clipboard",
        "ChangelogOlder": "Versiuni anterioare",
        "ChangelogPressToExpand": "Apăsați pentru a extinde",
        "Miscellaneous": "Altele",
        "ModeToggleAuto": "Mod auto",
        "ModeToggleAudio": "Mod Audio",
        "SettingsDisableNotifications": "Ascundeți punctele de notificare",
        "MediaPickerTitle": "Alegeți ce să salvați",
        "MediaPickerExplanationPC": "Click sau Click dreapta pentru a descărca ce vrei.",
        "MediaPickerExplanationPhone": "Apăsați sau țineți apăsat pentru a descărca ceea ce doriți.",
        "MediaPickerExplanationPhoneIOS": "Apăsați și țineți apăsat butonul de descărcare, ascundeți previzualizarea video, apoi selectați \"download linked file\" pentru a salva.",
        "TwitterSpaceWasntRecorded": "Acest spațiu Twitter nu a fost înregistrat, așa că nu este nimic de descărcat. Încercați altul!",
        "ErrorCantProcess": "Nu am putut procesa cererea dvs. :(\nputeți încerca din nou, dar dacă problema persistă, vă rugăm {ContactLink}.",
        "ChangelogPressToHide": "Apăsați pentru a restrânge",
        "Donate": "Donează",
        "DonateSub": "Ajută-mă să îl mențin",
        "DonateExplanation": "{appName} nu (si niciodată nu) va servi anunțuri sau va vinde datele tale, de aceea <span class=\"text-backdrop\"> este complet gratuit pentru folosință</span>. dar se pare că menținerea unui serviciu web folosit de mii de oameni este oarecum costisitor.\n\ndacă ai găsit vreodată {appName} folositor și vrei să îl păstrezi online, sau pur și simplu vrei să-i mulțumești dezvoltatorului, consideră să donezi! fiecare cent ajută și este FOARTE apreciat.",
        "DonateVia": "donează prin",
        "DonateHireMe": "sau, ca alternativă, poți <a class=\"text-backdrop italic\" href=\"{s}\" target=\"_blank\">să mă angajezi</a>.",
        "SettingsVideoMute": "oprește sunetul",
        "SettingsVideoMuteExplanation": "dezactivează audio în videoclipul descărcat atunci când este posibil.",
        "ErrorSoundCloudNoClientId": "nu a putut găsi client_id necesar pentru a prelua date audio de la soundcloud. încercați din nou, iar dacă problema persistă, {ContactLink}.",
        "CollapseServices": "servicii suportate",
        "CollapseSupport": "suport & cod sursă",
        "CollapsePrivacy": "politica de confidențialitate",
        "ServicesNote": "această listă nu este finală și continuă să se extindă în timp, asigură-te că verifici din când în când!",
        "FollowSupport": "urmărește {appName} pe mastodon sau twitter pentru suport, sondaje, știri și multe altele:",
        "SupportNote": "vă rugăm să reţineţi că întrebările şi problemele pot dura un timp pentru a răspunde, există o singură persoană care gestionează totul.",
        "SourceCode": "raportează probleme, explorează codul sursă, adaugă la favorite sau furcă repo-ul:",
        "PrivacyPolicy": "politica de confidențialitate a {appName} este simplă: nu sunt colectate sau stocate date despre dvs. zero, zilch, nada, nimic.\nceea ce descarci este treaba ta, nu a mea.\n\nunele date care nu pot fi urmărite sunt stocate temporar atunci când descărcarea solicitată necesită redare live. este necesar ca această caracteristică să funcționeze.\n\nîn acest caz, <span class=\"text-backdrop\">hash sha256 sărat al adresei dvs. IP</span> și informațiile despre fluxul solicitat sunt stocate temporar în memoria RAM a serverului timp de <span class=\"text-backdrop\">2 minute</span>. după 2 minute toate informațiile stocate anterior sunt șterse definitiv. hash-ul adresei dvs. IP este <span class=\"text-backdrop\">utilizat pentru a limita accesul la flux numai pentru dvs.</span>.\nnimeni (chiar și eu) nu are acces la aceste date, deoarece baza de cod oficială {appName} nu oferă o modalitate de a le citi în afara funcțiilor de procesare, în primul rând.\n\nputeți verifica pentru dvs. <a class=\"text-backdrop italic\" href=\"{repo}\" target=\"_blank\">repozitoriul github</a> de la {appName} și să vedeți că, într-adevăr, nimic nu este stocat permanent.",
        "ErrorYTUnavailable": "acest videoclip youtube este indisponibil sau restricționat de vârstă. în prezent nu pot descărca videoclipuri cu conținut sensibil. Încercați altul!",
        "ErrorYTTryOtherCodec": "nu am putut găsi nimic de descărcat cu setările tale. încearcă un alt codec sau calitate!\n\nnotă: api-ul youtube uneori acționează neașteptat. dă vina pe google pentru asta, nu pe mine.",
        "SettingsCodecSubtitle": "codec youtube",
        "SettingsCodecDescription": "h264: suport general mai bun pentru playere, dar calitatea maximă este la 1080p.\nav1: suport scăzut pentru playere, dar suportă 8k & HDR.\nvp9: de obicei cel mai mare bitrate, păstrează cele mai detaliate detalii. suportă 4k & HDR.\n\ndacă doriți cel mai bun editor/player/social media, alegeți h264.",
        "SettingsAudioDub": "pistă audio youtube",
        "SettingsAudioDubDescription": "definește ce pistă audio va fi folosită. dacă piesa dublată nu este disponibilă, limba video originală este folosită în schimb.\n\noriginal: este folosită limba video originală.\nauto: se folosește limba browser-ului implicit (și limba {appName}).",
        "SettingsDubDefault": "original",
        "SettingsDubAuto": "auto"
    }
}
