{
    "import.no_data": "파일에서 불러올 데이터가 없습니다. 올바른 파일인지 확인해주세요.",
    "import.invalid": "파일에 가져올 수 있는 유효한 cobalt 설정이 없습니다. 올바른 파일인지 확인해주세요.",
    "import.unknown": "파일에서 데이터를 불러올 수 없습니다. 파일이 손상되었거나 잘못된 형식일 수 있습니다. 오류 내용:\n\n{{ value }}",

    "remux.corrupted": "이 파일의 메타데이터를 읽을 수 없습니다. 파일이 손상되었을 수 있습니다.",
    "remux.out_of_resources": "cobalt가 리소스 부족으로 기기 내 처리를 계속할 수 없습니다. 이는 브라우저 측의 제한과 관련이 있습니다. 새로고침하거나 앱을 다시 열어 시도해보세요. 일부 기기는 아주 작은 파일만 처리할 수 있습니다.",

    "tunnel.probe": "파일을 다운로드할 수 있는지 확인할 수 없습니다. 잠시 후 다시 시도해주세요!",

    "captcha_ongoing": "봇이 아닌지 확인 중입니다. 스피너가 사라질 때까지 기다렸다가 다시 시도해주세요.\n\n너무 오래 걸리면 알려주세요! 봇 보호를 위해 Cloudflare Turnstile을 사용하는데, 가끔 정상적인 사용자를 차단하기도 합니다.",

    "api.auth.jwt.missing": "처리 서버가 사용자 인증 토큰을 받지 못해 봇이 아닌지 확인할 수 없습니다. 잠시 후 다시 시도하거나 페이지를 새로고침해주세요!",
    "api.auth.jwt.invalid": "사용자 인증 토큰이 만료되고 갱신되지 않아 봇이 아닌지 확인할 수 없습니다. 잠시 후 다시 시도하거나 페이지를 새로고침해주세요!",
    "api.auth.turnstile.missing": "처리 서버가 사용자 인증 토큰을 받지 못해 봇이 아닌지 확인할 수 없습니다. 잠시 후 다시 시도하거나 페이지를 새로고침해주세요!",
    "api.auth.turnstile.invalid": "사용자 인증 토큰이 만료되고 갱신되지 않아 봇이 아닌지 확인할 수 없습니다. 잠시 후 다시 시도하거나 페이지를 새로고침해주세요!",

    "api.unreachable": "처리 서버에 연결할 수 없습니다. 인터넷 연결을 확인하고 다시 시도해주세요.",
    "api.timed_out": "처리 서버의 응답 시간이 너무 깁니다. 현재 서버가 과부하 상태일 수 있으니 잠시 후 다시 시도해주세요!",
    "api.rate_exceeded": "요청이 너무 많습니다. {{ limit }}초 후에 다시 시도해주세요!",
    "api.capacity": "cobalt가 현재 용량 한계에 도달하여 요청을 처리할 수 없습니다. 잠시 후 다시 시도해주세요. 계속 작동하지 않으면 알려주시면 도와드리도록 하겠습니다!",

    "api.generic": "문제가 발생하여 요청을 처리할 수 없습니다. 잠시 후 다시 시도해주시고, 문제가 지속되면 알려주시면 도와드리도록 하겠습니다!",
    "api.unknown_response": "서버의 응답을 해석할 수 없습니다. 버전 불일치로 인한 문제일 수 있습니다. cobalt의 최신 버전을 사용하고 계신가요?",

    "api.service.unsupported": "아직 지원되지 않는 서비스입니다. 올바른 링크를 붙여넣으셨나요?",
    "api.service.disabled": "이 서비스는 cobalt에서 지원하지만, 이 인스턴스에서는 비활성화되어 있습니다. 다른 서비스의 링크를 시도해보세요!",

    "api.link.invalid": "링크가 유효하지 않거나 아직 지원되지 않는 서비스입니다. 올바른 링크를 붙여넣으셨나요?",
    "api.link.unsupported": "{{ service }}는 지원되지만, 링크를 인식할 수 없습니다. 올바른 링크를 붙여넣으셨나요?",

    "api.fetch.fail": "{{ service }}에서 정보를 가져오는 중 문제가 발생했습니다. 잠시 후 다시 시도해주세요. 문제가 계속되면 알려주시면 도와드리겠습니다!",
    "api.fetch.critical": "{{ service }} 모듈이 인식할 수 없는 오류를 반환했습니다. 잠시 후 다시 시도해주시고, 문제가 지속되면 알려주세요!",
    "api.fetch.empty": "다운로드할 수 있는 미디어를 찾을 수 없습니다. 올바른 링크를 붙여넣으셨나요?",
    "api.fetch.rate": "cobalt 처리 서버가 {{ service }} API에 의해 속도 제한되었습니다. 잠시 후 다시 시도해주세요!",
    "api.fetch.short_link": "단축 링크에서 정보를 가져올 수 없습니다. 링크가 작동하는지 확인해주세요. 링크가 작동하는데도 이 오류가 발생하면 알려주시면 도와드리도록 하겠습니다!",

    "api.content.too_long": "요청하신 미디어가 너무 깁니다. 현재 길이 제한은 {{ limit }}분입니다. 더 짧은 것을 시도해보세요!",

    "api.content.video.unavailable": "이 동영상에 접근할 수 없습니다. {{ service }} 측에서 제한되었을 수 있습니다. 올바른 링크를 붙여넣으셨나요?",
    "api.content.video.live": "이 동영상은 현재 라이브 중이라 다운로드할 수 없습니다. 라이브 스트리밍이 끝난 후 다시 시도해주세요!",
    "api.content.video.private": "이 동영상은 비공개이므로 접근할 수 없습니다. 공개 설정을 변경하거나 다른 동영상을 시도해보세요!",
    "api.content.video.age": "이 동영상은 연령 제한이 있어 익명으로 접근할 수 없습니다. 다른 동영상을 시도해보세요!",
    "api.content.video.region": "이 동영상은 지역 제한이 있고 처리 서버가 다른 지역에 있습니다. 다른 동영상을 시도해보세요!",

    "api.content.post.unavailable": "이 게시물에 대한 정보를 찾을 수 없습니다. 공개 범위가 제한되어 있거나 존재하지 않을 수 있습니다. 링크가 작동하는지 확인하고 잠시 후 다시 시도해주세요!",
    "api.content.post.private": "이 게시물은 비공개 계정의 것이라 접근할 수 없습니다. 올바른 링크를 붙여넣으셨나요?",
    "api.content.post.age": "이 게시물은 연령 제한이 있어 익명으로 접근할 수 없습니다. 올바른 링크를 붙여넣으셨나요?",

    "api.youtube.codec": "유튜브가 선호하는 비디오 코덱으로 된 콘텐츠를 반환하지 않았습니다. 설정에서 다른 코덱을 시도해보세요!",
    "api.youtube.decipher": "유튜브가 복호화 알고리즘을 업데이트하여 동영상 정보를 추출할 수 없습니다.\n\n잠시 후 다시 시도해보시고, 문제가 지속되면 지원을 요청해주세요.",
    "api.youtube.login": "유튜브가 봇으로 인식하여 동영상을 가져올 수 없습니다. 처리 인스턴스에 활성 계정 토큰이 없어서 발생했을 수 있습니다. 잠시 후 다시 시도해보시고, 계속 작동하지 않으면 인스턴스 관리자에게 이 오류를 알려주세요!",
    "api.youtube.token_expired": "유튜브 토큰이 만료되고 갱신할 수 없어서 동영상을 가져올 수 없습니다. 잠시 후 다시 시도해보시고, 계속 작동하지 않으면 인스턴스 관리자에게 이 오류를 알려주세요!",
    "api.youtube.no_hls_streams": "일치하는 HLS 스트림을 찾을 수 없습니다. 다른 설정을 시도해보세요!"
}
