{
    "reset.title": "รีเซ็ตการตั้งค่าทั้งหมด?",
    "reset.body": "คุณแน่ใจหรือไม่ว่าต้องการรีเซ็ตการตั้งค่าทั้งหมด? การกระทำนี้จะเกิดขึ้นทันทีและไม่สามารถย้อนกลับได้",

    "picker.title": "เลือกสิ่งที่ต้องการบันทึก",
    "picker.description.desktop": "คลิกที่รายการเพื่อบันทึก รูปภาพสามารถบันทึกได้ผ่านเมนูคลิกขวา",
    "picker.description.phone": "กดที่รายการเพื่อบันทึก รูปภาพสามารถบันทึกได้ด้วยการกดค้าง",
    "picker.description.ios": "กดที่รายการเพื่อบันทึกด้วยทางลัด รูปภาพสามารถบันทึกได้ด้วยการกดค้าง",

    "saving.title": "เลือกวิธีการบันทึก",
    "saving.blocked": "Cobalt พยายามเปิดไฟล์ในแท็บใหม่ แต่เบราว์เซอร์ของคุณบล็อกไว้ คุณสามารถอนุญาตให้มีป๊อปอัพสำหรับ Cobalt เพื่อป้องกันไม่ให้เกิดเหตุการณ์นี้ในครั้งหน้า",
    "saving.timeout": "Cobalt พยายามบันทึกไฟล์โดยอัตโนมัติ แต่เบราว์เซอร์ของคุณหยุดมันไว้ คุณต้องเลือกวิธีที่ต้องการด้วยตัวเอง",

    "safety.title": "ประกาศความปลอดภัยที่สำคัญ",

    "import.body": "การนำเข้าไฟล์ที่ไม่รู้จักหรือเสียหายอาจทำให้การทำงานของ Cobalt เปลี่ยนแปลงหรือเสียหายได้โดยไม่คาดคิด โปรดนำเข้าเฉพาะไฟล์ที่คุณได้ส่งออกด้วยตัวเองและยังไม่ได้ทำการแก้ไข หากมีใครขอให้คุณนำเข้าไฟล์นี้ - อย่าทำ\n\nเราไม่รับผิดชอบต่อความเสียหายใดๆ ที่เกิดจากการนำเข้าไฟล์การตั้งค่าที่ไม่รู้จัก",

    "api.override.title": "การแทนที่อินสแตนซ์การประมวลผล",
    "api.override.body": "{{ value }} เป็นอินสแตนซ์การประมวลผลใหม่ หากคุณไม่ไว้วางใจ กด \"ยกเลิก\" และมันจะถูกละเว้น\n\nคุณสามารถเปลี่ยนแปลงตัวเลือกนี้ในภายหลังในการตั้งค่าการประมวลผล",

    "safety.custom_instance.body": "อินสแตนซ์ที่กำหนดเองอาจก่อให้เกิดความเสี่ยงด้านความเป็นส่วนตัวและความปลอดภัย\n\nอินสแตนซ์ที่ไม่ดีอาจ:\n1. เปลี่ยนเส้นทางคุณออกจาก Cobalt และพยายามหลอกลวง\n2. บันทึกข้อมูลทั้งหมดเกี่ยวกับคำขอของคุณ เก็บข้อมูลนั้นไว้ตลอดไป และใช้เพื่อติดตามคุณ\n3. ให้บริการไฟล์ที่เป็นอันตราย (เช่น มัลแวร์)\n4. บังคับให้คุณดูโฆษณาหรือเรียกเก็บเงินสำหรับการดาวน์โหลด\n\nหลังจากจุดนี้ เราไม่สามารถปกป้องคุณได้ โปรดระมัดระวังในการใช้อินสแตนซ์ที่เลือก และเชื่อสัญชาตญาณของคุณ หากคุณรู้สึกว่ามีอะไรผิดปกติ ให้กลับมาที่หน้านี้ รีเซ็ตอินสแตนซ์ที่กำหนดเอง และรายงานให้เราทราบผ่าน GitHub",

    "processing.ongoing": "Cobalt กำลังประมวลผลสื่อในแท็บนี้ หากคุณออกไปจะเป็นการยกเลิกการประมวลผล คุณแน่ใจหรือว่าต้องการทำสิ่งนี้?",
    "processing.title.ongoing": "การประมวลผลจะถูกยกเลิก"
}
