{
    "import.no_data": "ไม่มีข้อมูลที่จะโหลดจากไฟล์ คุณแน่ใจหรือว่านี่เป็นไฟล์ที่ถูกต้อง?",
    "import.invalid": "ไฟล์ของคุณไม่มีการตั้งค่า Cobalt ที่ถูกต้องสำหรับการนำเข้า คุณแน่ใจหรือว่านี่เป็นไฟล์ที่ถูกต้อง?",
    "import.unknown": "ไม่สามารถโหลดข้อมูลจากไฟล์ได้ ไฟล์อาจเสียหายหรือมีรูปแบบผิด นี่คือข้อผิดพลาดที่ได้รับ:\n\n{{ value }}",

    "remux.corrupted": "ไม่สามารถอ่านข้อมูลเมตาจากไฟล์นี้ได้ ไฟล์อาจเสียหาย",
    "remux.out_of_resources": "Cobalt หมดทรัพยากรและไม่สามารถดำเนินการประมวลผลบนอุปกรณ์ต่อได้ ซึ่งเกี่ยวข้องกับข้อจำกัดของเบราว์เซอร์ของคุณ ลองรีเฟรชหรือเปิดแอปใหม่แล้วลองอีกครั้ง อุปกรณ์บางเครื่องสามารถประมวลผลได้เฉพาะไฟล์ขนาดเล็กเท่านั้น",

    "tunnel.probe": "ไม่สามารถตรวจสอบได้ว่าคุณสามารถดาวน์โหลดไฟล์นี้ได้ ลองใหม่อีกครั้งในไม่กี่วินาที!",

    "captcha_ongoing": "กำลังตรวจสอบว่าคุณไม่ใช่บอท รอให้ตัวหมุนหายไปแล้วลองอีกครั้ง\n\nหากใช้เวลานานเกินไป โปรดแจ้งให้เราทราบ! เราใช้ Cloudflare Turnstile สำหรับการป้องกันบอท และบางครั้งมันบล็อกคนโดยไม่มีเหตุผล",

    "api.auth.jwt.missing": "ไม่สามารถยืนยันได้ว่าคุณไม่ใช่บอทเนื่องจากเซิร์ฟเวอร์ประมวลผลไม่ได้รับโทเค็นการเข้าถึงของมนุษย์ ลองอีกครั้งในไม่กี่วินาทีหรือลองโหลดหน้าใหม่!",
    "api.auth.jwt.invalid": "ไม่สามารถยืนยันได้ว่าคุณไม่ใช่บอทเนื่องจากโทเค็นการเข้าถึงของมนุษย์ของคุณหมดอายุและไม่ได้ต่ออายุ ลองอีกครั้งในไม่กี่วินาทีหรือลองโหลดหน้าใหม่!",
    "api.auth.turnstile.missing": "ไม่สามารถยืนยันได้ว่าคุณไม่ใช่บอทเนื่องจากเซิร์ฟเวอร์ประมวลผลไม่ได้รับโทเค็นการเข้าถึงของมนุษย์ ลองอีกครั้งในไม่กี่วินาทีหรือลองโหลดหน้าใหม่!",
    "api.auth.turnstile.invalid": "ไม่สามารถยืนยันได้ว่าคุณไม่ใช่บอทเนื่องจากโทเค็นการเข้าถึงของมนุษย์ของคุณหมดอายุและไม่ได้ต่ออายุ ลองอีกครั้งในไม่กี่วินาทีหรือลองโหลดหน้าใหม่!",

    "api.unreachable": "ไม่สามารถเชื่อมต่อกับเซิร์ฟเวอร์ประมวลผลได้ ตรวจสอบการเชื่อมต่ออินเทอร์เน็ตของคุณแล้วลองอีกครั้ง",
    "api.timed_out": "เซิร์ฟเวอร์ประมวลผลใช้เวลานานเกินไปในการตอบสนอง อาจมีการทำงานเกินกำลังในขณะนี้ ลองใหม่อีกครั้งในไม่กี่วินาที!",
    "api.rate_exceeded": "คุณทำการร้องขอมากเกินไป ลองใหม่อีกครั้งใน {{ limit }} วินาที!",
    "api.capacity": "Cobalt ทำงานเต็มความสามารถแล้วและไม่สามารถประมวลผลคำขอของคุณได้ในขณะนี้ ลองใหม่อีกครั้งในไม่กี่วินาที หากยังไม่ได้ผล โปรดแจ้งให้เราทราบแล้วเราจะพยายามช่วยเหลือ!",

    "api.generic": "มีบางอย่างผิดพลาดและฉันไม่สามารถหาข้อมูลให้คุณได้ ลองใหม่อีกครั้งในไม่กี่วินาที แต่หากปัญหายังคงอยู่ โปรดแจ้งให้เราทราบแล้วเราจะพยายามช่วยเหลือ!",
    "api.unknown_response": "ไม่สามารถแยกวิเคราะห์การตอบสนองจากเซิร์ฟเวอร์ได้ อาจเกิดจากความไม่ตรงกันของเวอร์ชัน คุณแน่ใจหรือว่ากำลังใช้เวอร์ชันล่าสุดของ Cobalt?",

    "api.service.unsupported": "บริการนี้ยังไม่รองรับ คุณได้วางลิงก์ที่ถูกต้องแล้วหรือไม่?",
    "api.service.disabled": "บริการนี้รองรับโดย Cobalt แต่ถูกปิดการใช้งานในอินสแตนซ์นี้ ลองใช้ลิงก์จากบริการอื่น!",

    "api.link.invalid": "ลิงก์ของคุณไม่ถูกต้องหรือบริการนี้ยังไม่รองรับ คุณได้วางลิงก์ที่ถูกต้องแล้วหรือไม่?",
    "api.link.unsupported": "{{ service }} รองรับแล้ว แต่ฉันไม่สามารถจดจำลิงก์ของคุณได้ คุณได้วางลิงก์ที่ถูกต้องแล้วหรือไม่?",

    "api.fetch.fail": "มีบางอย่างผิดพลาดเมื่อดึงข้อมูลจาก {{ service }} และฉันไม่สามารถหาข้อมูลให้คุณได้ ลิงก์ของคุณใช้งานได้หรือไม่? หากใช่และคุณยังคงเห็นข้อผิดพลาดนี้ โปรดแจ้งให้เราทราบแล้วเราจะพยายามช่วยเหลือ!",
    "api.fetch.critical": "โมดูล {{ service }} คืนค่าข้อผิดพลาดที่ฉันไม่รู้จัก ลองใหม่อีกครั้งในไม่กี่วินาที แต่หากปัญหายังคงอยู่ โปรดแจ้งให้เราทราบ!",
    "api.fetch.empty": "ไม่พบสื่อใดๆ ที่ฉันสามารถดาวน์โหลดให้คุณได้ คุณได้วางลิงก์ที่ถูกต้องแล้วหรือไม่?",
    "api.fetch.rate": "เซิร์ฟเวอร์ประมวลผล Cobalt ถูกจำกัดอัตราการขอจาก API ของ {{ service }} ลองใหม่อีกครั้งในไม่กี่วินาที!",
    "api.fetch.short_link": "ไม่สามารถรับข้อมูลลิงก์จากลิงก์สั้นได้ คุณแน่ใจว่ามันใช้งานได้หรือไม่? หากใช่และคุณยังได้รับข้อผิดพลาดนี้ โปรดแจ้งให้เราทราบ แล้วเราจะพยายามช่วยเหลือ!",

    "api.content.too_long": "สื่อที่คุณร้องขอยาวเกินไป ขีดจำกัดระยะเวลาปัจจุบันคือ {{ limit }} นาที ลองสื่อที่สั้นกว่านี้แทน!",

    "api.content.video.unavailable": "ฉันไม่สามารถเข้าถึงวิดีโอนี้ได้ อาจมีการจำกัดโดยฝั่ง {{ service }} คุณได้วางลิงก์ที่ถูกต้องแล้วหรือไม่?",
    "api.content.video.live": "วิดีโอนี้กำลังถ่ายทอดสด ดังนั้นฉันยังไม่สามารถดาวน์โหลดได้ รอให้การถ่ายทอดสดสิ้นสุดก่อน แล้วลองใหม่อีกครั้ง!",
    "api.content.video.private": "วิดีโอนี้เป็นแบบส่วนตัว ดังนั้นฉันไม่สามารถเข้าถึงได้ เปลี่ยนการมองเห็นของมันหรือทดลองวิดีโออื่น!",
    "api.content.video.age": "วิดีโอนี้มีการจำกัดอายุ ดังนั้นฉันไม่สามารถเข้าถึงได้โดยไม่ระบุตัวตน ลองวิดีโออื่น!",
    "api.content.video.region": "วิดีโอนี้ถูกจำกัดตามภูมิภาค และเซิร์ฟเวอร์ประมวลผลอยู่ในตำแหน่งที่แตกต่างกัน ลองวิดีโออื่น!",

    "api.content.post.unavailable": "ไม่พบข้อมูลใดๆ เกี่ยวกับโพสต์นี้ อาจมีการจำกัดการมองเห็นหรืออาจไม่มีอยู่จริง ตรวจสอบให้แน่ใจว่าลิงก์ของคุณใช้งานได้แล้วลองใหม่อีกครั้งในไม่กี่วินาที!",
    "api.content.post.private": "โพสต์นี้มาจากบัญชีส่วนตัว ดังนั้นฉันไม่สามารถเข้าถึงได้ คุณได้วางลิงก์ที่ถูกต้องแล้วหรือไม่?",
    "api.content.post.age": "โพสต์นี้มีการจำกัดอายุ ดังนั้นฉันไม่สามารถเข้าถึงได้โดยไม่ระบุตัวตน คุณได้วางลิงก์ที่ถูกต้องแล้วหรือไม่?",

    "api.youtube.codec": "YouTube ไม่ส่งคืนสิ่งใดๆ ที่มีรหัสวิดีโอที่คุณต้องการ ลองอันอื่นในการตั้งค่า!",
    "api.youtube.decipher": "YouTube อัปเดตอัลกอริทึมถอดรหัสของพวกเขา และฉันไม่สามารถดึงข้อมูลเกี่ยวกับวิดีโอได้\n\nลองใหม่อีกครั้งในไม่กี่วินาที แต่หากปัญหายังคงอยู่ โปรดติดต่อเราสำหรับการสนับสนุน",
    "api.youtube.login": "ไม่สามารถรับวิดีโอนี้ได้เนื่องจาก YouTube ระบุว่าฉันเป็นบอท ซึ่งอาจเกิดจากอินสแตนซ์การประมวลผลที่ไม่มีโทเค็นบัญชีที่ใช้งานอยู่ ลองใหม่อีกครั้งในไม่กี่วินาที แต่หากยังไม่ได้ผล โปรดแจ้งเจ้าของอินสแตนซ์เกี่ยวกับข้อผิดพลาดนี้!",
    "api.youtube.token_expired": "ไม่สามารถรับวิดีโอนี้ได้เนื่องจากโทเค็น YouTube หมดอายุและฉันไม่สามารถรีเฟรชมันได้ ลองใหม่อีกครั้งในไม่กี่วินาที แต่หากยังไม่ได้ผล โปรดแจ้งเจ้าของอินสแตนซ์เกี่ยวกับข้อผิดพลาดนี้!"
}
